[
  {
    "id": "69850081346d6159eee7ef87",
    "title": "1.8 KVA Amizar  Inverter",
    "slug": "1-8-kva-amizar-inverter",
    "productType": "simple",
    "shortDescription": "1.8 KVA Amizar pure sine wave inverter for reliable backup power in homes and small offices.",
    "description": "The 1.8 KVA Amizar Inverter delivers clean, stable power conversion from DC to AC, making it ideal for powering household appliances, lighting, and electronics during outages. With a 1.8 KVA capacity, it comfortably handles loads such as TVs, fans, phone chargers, and LED lighting. The pure sine wave output protects sensitive equipment from power surges and distortion. Built with overload protection and a compact design, this inverter pairs perfectly with 12V or 24V battery banks for dependable off-grid or backup power solutions."
  },
  {
    "id": "698501a5346d6159eee7f265",
    "title": "100w Emergency Solar Light",
    "slug": "100w-emergency-solar-light",
    "productType": "simple",
    "shortDescription": "Portable 100W solar emergency light with rechargeable battery and automatic dusk-to-dawn operation.",
    "description": "Keep your home or business lit during unexpected power cuts with this 100W Emergency Solar Light. Equipped with a high-capacity rechargeable battery and an efficient solar charging panel, it provides hours of bright light on a single charge. The automatic sensor switches the light on at dusk and off at dawn, making it completely hands-free. Its weather-resistant housing withstands rain and dust, while the compact form factor allows easy mounting on walls, poles, or fences around your property."
  },
  {
    "id": "698506ee346d6159eee7f8bd",
    "title": "1200mm by 1800mm masive chandaria",
    "slug": "1200mm-by-1800mm-masive-chandaria",
    "productType": "simple",
    "shortDescription": "Grand 1200mm x 1800mm crystal chandelier for large halls, hotels, and luxury interiors.",
    "description": "Make a bold statement with this massive 1200mm by 1800mm chandelier, designed for grand entrances, hotel lobbies, churches, and large living spaces. The generous dimensions ensure it fills high-ceiling rooms with elegance and sparkle. Featuring multiple tiers of crystal or glass elements, it creates stunning light reflections that transform any space into a luxurious setting. Built on a sturdy metal frame with a secure ceiling mount, this chandelier supports multiple bulb holders for brilliant, room-filling illumination."
  },
  {
    "id": "6984ffa6346d6159eee7edaf",
    "title": "120W streetlight Solar Light",
    "slug": "120w-streetlight-solar-light",
    "productType": "simple",
    "shortDescription": "120W all-in-one solar street light with dusk-to-dawn sensor for roads, estates, and public areas.",
    "description": "The 120W Solar Street Light is a complete, self-contained outdoor lighting solution that requires no grid connection or trenching. It combines a high-efficiency monocrystalline solar panel, a long-life lithium battery, and a 120W LED lamp in a single unit. The built-in light sensor automatically turns the light on at dusk and off at dawn, while the motion sensor can boost brightness when movement is detected. Ideal for illuminating streets, estate roads, school compounds, car parks, and rural pathways, it delivers reliable bright light every night with zero electricity bills."
  },
  {
    "id": "698502a3346d6159eee7f579",
    "title": "125A dc mcb",
    "slug": "125a-dc-mcb",
    "productType": "simple",
    "shortDescription": "125A DC miniature circuit breaker for high-current solar and battery system protection.",
    "description": "This 125A DC MCB provides overcurrent and short-circuit protection for high-capacity solar PV systems, battery banks, and DC distribution boards. Rated for DC voltages up to 250V or 1000V depending on pole configuration, it safely interrupts fault currents to protect your inverters, charge controllers, and wiring. The 125A rating makes it suitable for large solar arrays and commercial battery storage installations where high current flows are common. DIN-rail mountable for quick installation in standard enclosure boxes and distribution boards."
  },
  {
    "id": "69850369346d6159eee7f6ed",
    "title": "12v led strip light",
    "slug": "12v-led-strip-light",
    "productType": "simple",
    "shortDescription": "Flexible 12V DC LED strip light for accent lighting, signage, and decorative indoor or outdoor use.",
    "description": "This 12V LED Strip Light is a versatile, flexible lighting solution perfect for under-cabinet lighting, cove lighting, signage backlighting, and decorative accents. Running on safe 12V DC power, it can be powered directly from a solar battery system or a 12V power supply. The self-adhesive backing allows easy installation on flat surfaces, and the strip can be cut to length at marked intervals for a custom fit. Available in warm white, cool white, and RGB colour options, it delivers bright, even illumination with low power consumption and long-lasting LED performance."
  },
  {
    "id": "698504d4346d6159eee7f795",
    "title": "12v motor siren ms-290",
    "slug": "12v-motor-siren-ms-290",
    "productType": "simple",
    "shortDescription": "12V MS-290 motor siren for security alarms, industrial warnings, and emergency signalling.",
    "description": "The MS-290 Motor Siren is a powerful 12V DC-powered alarm device that produces a loud, distinctive wailing sound to alert people to emergencies, intrusions, or hazardous conditions. Operating on 12V makes it compatible with battery backup systems and solar setups, ensuring it works even during power outages. The compact metal housing is durable and weather-resistant, suitable for both indoor and outdoor installation. Commonly used for factory shift signals, security alarm systems, fire alerts, and general warning applications in homes, warehouses, and commercial premises."
  },
  {
    "id": "6984ff9d346d6159eee7ed9d",
    "title": "12w Motion Sensor Panel Surface Mounted 240vac",
    "slug": "12w-motion-sensor-panel-surface-mounted-240vac",
    "productType": "simple",
    "shortDescription": "12W surface-mounted LED panel light with built-in motion sensor, 240V AC operation.",
    "description": "This 12W Motion Sensor LED Panel Light combines energy-efficient illumination with smart motion detection in a single surface-mounted fixture. Running on standard 240V AC mains power, it automatically turns on when it detects movement and switches off after a set delay, saving electricity in corridors, stairwells, bathrooms, and storage rooms. The slim, round surface-mount design installs directly onto ceilings without any recessing, making it perfect for concrete soffits and rooms where false ceilings are not available. It produces bright, flicker-free white light with a long LED lifespan."
  },
  {
    "id": "698506b9346d6159eee7f8ab",
    "title": "12w led panel drives",
    "slug": "12w-led-panel-drives",
    "productType": "simple",
    "shortDescription": "12W LED panel driver for powering recessed and surface-mounted LED panel lights.",
    "description": "This 12W LED Panel Driver is a constant-current power supply designed to safely power 12W LED panel lights. It converts 240V AC mains voltage to the low-voltage DC output required by LED panels, with built-in overload, short-circuit, and overvoltage protection. The compact, lightweight design fits easily above false ceilings or inside junction boxes. Use it as a direct replacement for a faulty panel driver or as a spare for maintenance. Compatible with most standard 12W round and square LED panels."
  },
  {
    "id": "6985066b346d6159eee7f851",
    "title": "12w recess panel",
    "slug": "12w-recess-panel",
    "productType": "simple",
    "shortDescription": "12W recessed LED panel light for flush ceiling installation in offices, shops, and homes.",
    "description": "The 12W Recessed LED Panel delivers clean, uniform lighting from a sleek flush-mounted fixture that sits neatly inside false ceilings. Its slim profile and round design blend seamlessly into any interior, making it ideal for offices, retail shops, kitchens, and living rooms. The 12W output provides ample brightness while consuming minimal electricity compared to traditional fluorescent downlights. Easy to install with spring clips that hold it securely in the ceiling cutout, it produces flicker-free, eye-friendly light for comfortable working and living environments."
  },
  {
    "id": "698501f8346d6159eee7f319",
    "title": "150w Alltop Solar Sensor Light",
    "slug": "150w-alltop-solar-sensor-light",
    "productType": "simple",
    "shortDescription": "150W Alltop solar sensor light with motion detection for driveways, gates, and compound security.",
    "description": "The 150W Alltop Solar Sensor Light is a high-performance outdoor security light powered entirely by the sun. The integrated solar panel charges a long-life lithium battery during the day, and the built-in PIR motion sensor triggers the full 150W LED brightness when movement is detected at night. In standby mode, it operates at a lower brightness level to conserve energy while still providing ambient visibility. The Alltop brand is known for durable construction and reliable solar components, making this light perfect for securing gates, driveways, compound perimeters, and commercial property entrances without any electricity costs."
  },
  {
    "id": "69850174346d6159eee7f1e0",
    "title": "15A sigle metalic socket",
    "slug": "15a-sigle-metalic-socket",
    "productType": "simple",
    "shortDescription": "15A single metallic socket outlet for heavy-duty appliances in industrial and domestic settings.",
    "description": "This 15A Single Metallic Socket is built for durability and higher-current applications. The brushed metal faceplate provides a robust, professional finish that resists scratches and wear, making it suitable for workshops, kitchens, and commercial environments where standard plastic sockets may not hold up. Rated at 15 amps, it safely handles heavier loads such as water heaters, electric cookers, and power tools. The socket mounts on a standard patress box and features secure screw terminals for safe, reliable wiring connections."
  },
  {
    "id": "6985023d346d6159eee7f3dd",
    "title": "16A 2p dc mcb",
    "slug": "16a-2p-dc-mcb",
    "productType": "simple",
    "shortDescription": "16A double-pole DC miniature circuit breaker for solar PV and battery circuit protection.",
    "description": "The 16A 2-Pole DC MCB provides reliable overcurrent and short-circuit protection for small to medium solar installations. The double-pole design disconnects both positive and negative lines simultaneously, which is essential for safe DC circuit isolation. With a 16A current rating, it is well-suited for protecting individual solar panel strings, charge controllers, and small inverter inputs. DIN-rail mountable and compatible with standard enclosure boxes, it installs quickly into any solar distribution board for compliant, code-ready protection."
  },
  {
    "id": "69850670346d6159eee7f863",
    "title": "18w recess led panel",
    "slug": "18w-recess-led-panel",
    "productType": "simple",
    "shortDescription": "18W recessed LED panel light delivering bright, even illumination for offices and commercial spaces.",
    "description": "This 18W Recessed LED Panel Light offers high-output, energy-efficient ceiling lighting in a slim, flush-mount design. At 18 watts it provides significantly brighter illumination than smaller panels, making it the go-to choice for offices, conference rooms, hospital corridors, and retail spaces that need generous light coverage. The round panel installs into a standard ceiling cutout with spring retention clips, sitting flush for a clean, modern appearance. It delivers consistent, shadow-free light with excellent colour rendering, reducing eye strain during long working hours."
  },
  {
    "id": "6985067f346d6159eee7f875",
    "title": "18w surface panel",
    "slug": "18w-surface-panel",
    "productType": "simple",
    "shortDescription": "18W surface-mounted LED panel light for ceilings without false ceiling cavities.",
    "description": "The 18W Surface-Mounted LED Panel Light is designed for rooms where recessing into the ceiling is not possible — such as concrete soffits, verandas, and older buildings. It mounts directly onto the ceiling surface with screws, and its slim, enclosed housing gives a neat, modern look. The 18W output provides bright, uniform white light across bedrooms, corridors, kitchens, and office spaces. Energy-efficient LED technology means lower electricity bills and a lifespan of up to 50,000 hours, far outlasting conventional fluorescent fixtures."
  },
  {
    "id": "698500ca346d6159eee7f02a",
    "title": "2 Gang Way Switches",
    "slug": "2-gang-way-switches",
    "productType": "simple",
    "shortDescription": "2-gang light switch for controlling two separate lighting circuits from one wall plate.",
    "description": "The 2-Gang Way Switch allows you to control two independent lighting circuits from a single wall-mounted switch plate. Each rocker operates its own circuit, so you can turn on the living room light while leaving the hallway off, all from one convenient location. The clean white faceplate suits modern interiors, and the mechanism fits standard patress boxes for straightforward installation. Built with durable contacts rated for everyday residential and commercial use, this switch is a staple for any electrical wiring project."
  },
  {
    "id": "69850092346d6159eee7ef9a",
    "title": "200Ah Solar Battery",
    "slug": "200ah-solar-battery",
    "productType": "simple",
    "shortDescription": "200Ah deep-cycle solar battery for reliable energy storage in off-grid and hybrid solar systems.",
    "description": "This 200Ah Solar Battery is purpose-built for deep-cycle applications in solar power systems. Unlike standard car batteries, it is designed to be regularly discharged and recharged, providing dependable energy storage for off-grid homes, backup power systems, and hybrid solar installations. The 200Ah capacity stores enough energy to power essential household loads — lighting, phone charging, TV, and fans — through the night or during extended cloudy periods. Maintenance-free sealed construction means no topping up with distilled water, and the robust terminals ensure secure cable connections for trouble-free operation."
  },
  {
    "id": "6985029f346d6159eee7f567",
    "title": "200ah luminous batter",
    "slug": "200ah-luminous-batter",
    "productType": "simple",
    "shortDescription": "200Ah Luminous brand tubular battery designed for inverter and solar backup applications.",
    "description": "The 200Ah Luminous Battery is a premium tubular battery from the trusted Luminous brand, engineered specifically for inverter and solar power systems. Tubular plate technology delivers superior deep-cycle performance, longer backup times, and an extended service life compared to flat plate batteries. With a 200Ah capacity, it provides ample power storage for homes and small businesses running on solar or inverter backup. The Luminous brand is well-known for quality and after-sales support, making this battery a reliable choice for customers who need dependable energy storage with minimal maintenance."
  },
  {
    "id": "69850119346d6159eee7f0f1",
    "title": "200w tronic floodlight",
    "slug": "200w-tronic-floodlight",
    "productType": "simple",
    "shortDescription": "200W Tronic LED floodlight for powerful outdoor illumination of compounds, sports fields, and work sites.",
    "description": "The 200W Tronic Floodlight delivers intense, wide-angle illumination for large outdoor areas. With 200 watts of LED power, it produces a massive light output that can cover entire compound perimeters, construction sites, sports courts, and car parks. The Tronic brand ensures quality LED chips with good colour rendering and consistent brightness over time. An IP65-rated die-cast aluminium housing protects against rain, dust, and harsh weather, while the adjustable mounting bracket lets you direct the beam exactly where it is needed. Energy-efficient LED technology keeps running costs low despite the high light output."
  },
  {
    "id": "698501d4346d6159eee7f2bf",
    "title": "20mm 2way Circular box",
    "slug": "20mm-2way-circular-box",
    "productType": "simple",
    "shortDescription": "20mm 2-way circular junction box for connecting two conduit runs at a junction point.",
    "description": "This 20mm 2-Way Circular Box is a standard PVC wiring accessory used to join two 20mm conduit runs at a straight-through or angled junction. It provides a neat, enclosed connection point where cables can be routed, pulled, or inspected within a conduit installation. The removable lid allows easy access for maintenance and cable pulling. Made from durable, flame-retardant PVC, it is suitable for surface-mounted domestic and commercial electrical installations. Accepts standard 20mm PVC conduit with push-fit or glued connections."
  },
  {
    "id": "698501d0346d6159eee7f2ad",
    "title": "20mm 3way Circular box",
    "slug": "20mm-3way-circular-box",
    "productType": "simple",
    "shortDescription": "20mm 3-way circular junction box for branching conduit runs in surface wiring installations.",
    "description": "The 20mm 3-Way Circular Box enables you to branch a conduit run into three directions from a single junction point. This is essential when routing cables from a main line to multiple circuits — for example, splitting a lighting feed to serve different rooms. Like the 2-way variant, it features a removable inspection lid and is made from tough, flame-retardant PVC that meets electrical installation standards. It accepts 20mm PVC conduit and is a core component in any neat, code-compliant surface wiring installation."
  },
  {
    "id": "69850270346d6159eee7f4a1",
    "title": "20mm pvc bends",
    "slug": "20mm-pvc-bends",
    "productType": "simple",
    "shortDescription": "20mm PVC conduit bends for routing electrical wiring around corners and obstacles.",
    "description": "These 20mm PVC Bends are used to change the direction of a 20mm conduit run when routing electrical cables around corners, beams, or obstacles on walls and ceilings. The smooth, pre-formed 90-degree curve ensures cables can be pulled through without snagging or damaging insulation. Made from rigid, flame-retardant PVC, they maintain the same strength and protection as straight conduit sections. Essential for any surface wiring installation in homes, offices, and commercial buildings where neat, protected cable routing is required."
  },
  {
    "id": "698500a6346d6159eee7efd0",
    "title": "20mm pvc conduit 10ft",
    "slug": "20mm-pvc-conduit-10ft",
    "productType": "simple",
    "shortDescription": "10-foot length of 20mm rigid PVC conduit for protecting and routing electrical wiring.",
    "description": "This 10-foot (3-metre) length of 20mm PVC Conduit is the backbone of any surface-mounted electrical wiring installation. It provides mechanical protection for cables run along walls and ceilings, shielding them from physical damage, moisture, and UV exposure. The rigid PVC construction is lightweight, easy to cut, and flame-retardant. Standard 20mm diameter is the most common size for domestic and light commercial wiring, compatible with 20mm bends, circular boxes, saddle clips, and couplings. Stock up on these for full house wiring, renovations, or commercial fit-outs."
  },
  {
    "id": "69850274346d6159eee7f4b3",
    "title": "25mm normal bends",
    "slug": "25mm-normal-bends",
    "productType": "simple",
    "shortDescription": "25mm PVC conduit bends for larger wiring installations requiring direction changes.",
    "description": "These 25mm PVC Bends are designed for use with 25mm rigid conduit, which is typically used in commercial and industrial wiring installations that carry more or thicker cables than standard 20mm conduit can accommodate. The pre-formed 90-degree bends allow smooth direction changes around corners without kinking or damaging the cables inside. Made from durable, flame-retardant PVC, they are suitable for both indoor and sheltered outdoor installations. A must-have accessory for electricians working on larger-scale wiring projects."
  },
  {
    "id": "69850298346d6159eee7f555",
    "title": "25mm welding cable",
    "slug": "25mm-welding-cable",
    "productType": "simple",
    "shortDescription": "25mm² flexible rubber-insulated welding cable for arc welders and high-current connections.",
    "description": "This 25mm² Welding Cable is a heavy-duty, highly flexible conductor designed to carry the high currents demanded by electric arc welding machines. The fine-stranded copper core provides excellent flexibility, allowing the cable to be bent and routed without fatigue, while the thick rubber insulation resists heat, abrasion, and oil. Beyond welding, it is also used for battery interconnections in large solar battery banks, generator leads, and other high-current DC applications. Sold by the metre, so you can order the exact length you need."
  },
  {
    "id": "6985039a346d6159eee7f719",
    "title": "2T RATCHET CABLE PULLER",
    "slug": "2t-ratchet-cable-puller",
    "productType": "simple",
    "shortDescription": "2-ton ratchet cable puller for tensioning and pulling overhead power lines and guy wires.",
    "description": "The 2-Ton Ratchet Cable Puller is a heavy-duty hand tool used by electricians and line workers to tension, pull, and position overhead cables and guy wires. With a 2-ton pulling capacity, it handles standard power distribution lines and telecommunication cables with ease. The ratchet mechanism provides controlled, incremental pulling force, allowing precise tensioning without overloading the cable. Sturdy steel construction with a comfortable grip ensures durability in the field. An essential tool for power line installation, maintenance, and rural electrification projects."
  },
  {
    "id": "6985030e346d6159eee7f683",
    "title": "2T ratchet 360° turn",
    "slug": "2t-ratchet",
    "productType": "simple",
    "shortDescription": "2-ton ratchet puller with 360° swivel head for flexible cable and wire tensioning.",
    "description": "This 2-Ton Ratchet with 360° Turn features a full-rotation swivel head that allows the pulling point to rotate freely, eliminating cable twist and making it easier to work at awkward angles on overhead lines. The 2-ton capacity is sufficient for most distribution-level power cable pulling and guy wire tensioning tasks. The ratchet pawl mechanism ensures the load is held securely at every increment, and the release lever allows controlled slackening when tensioning is complete. Built from hardened steel for rugged field use, this is a step up in versatility over fixed-head pullers."
  },
  {
    "id": "69850136346d6159eee7f14b",
    "title": "2ft Waterproof  Led Light",
    "slug": "2ft-waterproof-led-light",
    "productType": "simple",
    "shortDescription": "2-foot waterproof LED batten light for bathrooms, outdoor canopies, and damp environments.",
    "description": "This 2ft Waterproof LED Light is a sealed batten fixture designed for locations where moisture, dust, and water splashes are a concern. Its IP65-rated housing keeps out water jets and fine dust, making it ideal for bathrooms, kitchens, covered walkways, car washes, laundry rooms, and food processing areas. The compact 2-foot length fits neatly in smaller spaces while providing bright, even illumination. Pre-wired and ready to connect to 240V mains, it requires no separate tube or starter, significantly reducing maintenance compared to old fluorescent fittings."
  },
  {
    "id": "6985019f346d6159eee7f253",
    "title": "2m Recess Profile",
    "slug": "2m-recess-profile",
    "productType": "simple",
    "shortDescription": "2-metre aluminium recess profile for embedding LED strip lights into ceilings and walls.",
    "description": "This 2m Recess Aluminium Profile is designed to be set into a routed channel in gypsum ceilings, plasterboard walls, or wooden surfaces, creating a sleek, flush-mounted housing for LED strip lights. The recessed installation hides the strip completely, leaving only a smooth line of light visible for a high-end architectural lighting effect. The aluminium body acts as a heat sink to extend LED strip lifespan, and the included frosted diffuser cover eliminates visible LED dots for uniform, glare-free illumination. Perfect for modern interiors, hospitality fit-outs, and retail display lighting."
  },
  {
    "id": "698501b2346d6159eee7f277",
    "title": "2p Andeli Double Pole",
    "slug": "2p-andeli-double-pole",
    "productType": "simple",
    "shortDescription": "2-pole Andeli MCB for simultaneous live and neutral circuit protection in AC installations.",
    "description": "The 2-Pole Andeli Double Pole MCB disconnects both the live and neutral conductors simultaneously when a fault is detected, providing complete isolation for critical circuits like water heaters, air conditioners, and cooker supplies. Andeli is a well-regarded brand for circuit protection devices, offering reliable tripping characteristics and durable contact mechanisms. DIN-rail mountable, it fits standard distribution boards and consumer units. Available in various current ratings, it meets the requirements for residential and commercial AC electrical installations where double-pole isolation is mandated by wiring regulations."
  },
  {
    "id": "6985059d346d6159eee7f7dd",
    "title": "2p ac spd",
    "slug": "2p-ac-spd",
    "productType": "simple",
    "shortDescription": "2-pole AC surge protection device to shield electronics and appliances from voltage spikes.",
    "description": "This 2-Pole AC SPD (Surge Protection Device) guards your electrical installation against transient voltage spikes caused by lightning strikes, power grid switching, and load fluctuations. Installed in the distribution board on the AC mains supply, it diverts excess voltage safely to earth before it can reach sensitive appliances like TVs, computers, refrigerators, and inverters. The 2-pole design protects both live and neutral lines in single-phase installations. A visual indicator window shows the protection status at a glance, and DIN-rail mounting makes installation quick and tidy."
  },
  {
    "id": "69850060346d6159eee7ef3f",
    "title": "2p mcb breaker",
    "slug": "2p-mcb-breaker",
    "productType": "variable",
    "shortDescription": "2-pole AC miniature circuit breaker available in multiple current ratings for double-pole protection.",
    "description": "The 2-Pole MCB Breaker provides double-pole overcurrent and short-circuit protection for AC circuits, disconnecting both live and neutral simultaneously during a fault. Available in multiple current ratings to match your circuit requirements, it is ideal for protecting dedicated appliance circuits such as water heaters, cookers, and air conditioning units where full isolation is needed for safety. Its compact design fits standard DIN-rail distribution boards, and the toggle handle gives clear visual indication of the on/off state. A reliable, everyday circuit protection device for residential and commercial electrical boards."
  },
  {
    "id": "69850240346d6159eee7f3ef",
    "title": "2p solar  spd 1000vdc",
    "slug": "2p-solar-spd-1000vdc",
    "productType": "simple",
    "shortDescription": "2-pole 1000V DC surge protection device for safeguarding solar PV arrays against lightning surges.",
    "description": "Protect your solar investment with this 2-Pole 1000V DC SPD, specifically designed for photovoltaic systems. Solar panels on rooftops are highly exposed to lightning-induced surges, and a single strike can destroy expensive inverters, charge controllers, and panel junction boxes. This SPD clamps transient overvoltages on the DC side before they reach downstream equipment. Rated at 1000V DC, it is compatible with high-voltage string inverter configurations. DIN-rail mountable with clear status indication, it is an essential safety component in any professionally installed solar system."
  },
  {
    "id": "69850210346d6159eee7f33d",
    "title": "300w Solar Street  Light",
    "slug": "300w-solar-street-light",
    "productType": "simple",
    "shortDescription": "300W all-in-one solar street light for highways, commercial areas, and large-scale outdoor lighting.",
    "description": "The 300W Solar Street Light is a high-power, all-in-one outdoor lighting solution designed for wide roads, highways, commercial parking lots, and large public spaces. The powerful 300W LED array produces exceptional brightness that rivals grid-powered street lights, while the integrated solar panel and high-capacity lithium battery ensure it operates entirely off-grid. Automatic dusk-to-dawn operation with intelligent brightness control maximises battery life through the night. The rugged, weatherproof construction withstands heavy rain, strong winds, and extreme temperatures, making it a long-term, zero-electricity-cost lighting investment."
  },
  {
    "id": "698502bd346d6159eee7f5f7",
    "title": "32650 liFePo4 batteries",
    "slug": "32700-lifepo4-batteries",
    "productType": "simple",
    "shortDescription": "32650 LiFePO4 rechargeable cells for DIY battery packs, solar storage, and electric vehicles.",
    "description": "These 32650 LiFePO4 (Lithium Iron Phosphate) battery cells offer exceptional cycle life, thermal stability, and safety for DIY battery pack builders and system integrators. LiFePO4 chemistry can endure 2,000+ charge-discharge cycles while maintaining over 80% capacity, far outlasting lead-acid and standard lithium-ion alternatives. The 3.2V nominal voltage per cell makes them easy to configure in series for 12V, 24V, or 48V battery packs used in solar energy storage, electric bicycles, UPS systems, and portable power stations. Their inherent resistance to thermal runaway makes them one of the safest lithium battery chemistries available."
  },
  {
    "id": "6984ff88346d6159eee7ed7d",
    "title": "32A 1000v Disconect with mc4",
    "slug": "32a-1000v-disconect-with-mc4",
    "productType": "simple",
    "shortDescription": "32A 1000V DC disconnect switch with MC4 connectors for quick, safe solar panel isolation.",
    "description": "This 32A 1000V DC Disconnect Switch comes pre-fitted with MC4 connectors, allowing you to install it directly inline with your solar panel cables without additional crimping or adapters. It provides a safe, code-compliant means of isolating the DC power from your solar array for maintenance, inspection, or emergency shutdown. The 32A/1000V rating suits most residential and small commercial PV string configurations. The rotary handle locks in the off position for added safety, and the IP66-rated enclosure protects the switch mechanism from rain and dust in rooftop or outdoor installations."
  },
  {
    "id": "6984ff87346d6159eee7ed79",
    "title": "32A 63A Solar PV DC Disconnect SWITCH",
    "slug": "32a-63a-solar-pv-dc-disconnect-switch",
    "productType": "variable",
    "shortDescription": "Solar PV DC disconnect switch available in 32A and 63A ratings for safe array isolation.",
    "description": "The Solar PV DC Disconnect Switch is a rotary isolator designed to safely disconnect solar panels from the rest of the electrical system. Available in 32A and 63A variants, it covers both small residential arrays and larger commercial rooftop installations. Rated for high DC voltages up to 1000V, it can handle the open-circuit voltage of long panel strings. The enclosed rotary mechanism provides visible on/off indication and can be padlocked in the off position for lockout/tagout safety procedures. Weather-resistant housing allows outdoor mounting near the solar array or combiner box."
  },
  {
    "id": "69850251346d6159eee7f445",
    "title": "32A Chint double pole",
    "slug": "32a-chint-double-pole",
    "productType": "variable",
    "shortDescription": "32A Chint double-pole MCB for reliable two-pole circuit protection in residential and commercial boards.",
    "description": "The 32A Chint Double Pole MCB is a trusted circuit protection device from the globally recognised Chint brand. It provides simultaneous disconnection of both live and neutral conductors at 32 amps, making it ideal for protecting dedicated circuits feeding water heaters, cooker connections, and high-power appliances. Chint MCBs are known for precise tripping characteristics, high breaking capacity, and long mechanical life. The compact DIN-rail mount design slots easily into standard distribution boards. Available in variable configurations to match specific installation requirements."
  },
  {
    "id": "6985023a346d6159eee7f3cb",
    "title": "3Phase spd 1000vdc",
    "slug": "product-2",
    "productType": "simple",
    "shortDescription": "3-phase 1000V DC surge protection device for large-scale solar PV installations.",
    "description": "This 3-Phase 1000V DC SPD provides comprehensive surge protection for three-phase solar PV systems and large DC distribution setups. It clamps lightning-induced transient voltages across all three DC conductors simultaneously, preventing catastrophic damage to string inverters, combiner boxes, and monitoring equipment. The 1000V DC rating makes it suitable for high-voltage solar string configurations common in commercial and industrial rooftop or ground-mount arrays. DIN-rail mountable with visual status indicators on each phase module, it ensures your entire solar installation remains protected from the unpredictable power surges that come with storm seasons."
  },
  {
    "id": "69850632346d6159eee7f82d",
    "title": "3W led recess  panel",
    "slug": "3w-led-recess-panel",
    "productType": "simple",
    "shortDescription": "Compact 3W recessed LED panel light for accent and task lighting in ceilings and cabinets.",
    "description": "The 3W Recessed LED Panel is a compact, low-power downlight that fits into small ceiling cutouts to provide focused accent or task lighting. At just 3 watts, it is perfect for hallway highlights, display cabinet illumination, bathroom mirrors, and stairwell markers where you need a point of light without high energy consumption. The slim profile sits nearly flush with the ceiling for a clean, modern look, and spring clips hold it securely in place. Despite its small size, it produces a bright, focused beam with excellent colour rendering for true-to-life colours."
  },
  {
    "id": "69850195346d6159eee7f22f",
    "title": "3m Alluminium Profiles",
    "slug": "3m-alluminium-profiles",
    "productType": "simple",
    "shortDescription": "3-metre aluminium channel profile for mounting and diffusing LED strip lights.",
    "description": "This 3m Aluminium Profile provides a professional housing for LED strip lights, turning a basic adhesive strip into a polished linear light fixture. The aluminium channel serves as both a mounting track and a heat sink that draws heat away from the LEDs to extend their lifespan. A snap-on frosted diffuser cover smooths out individual LED dots into a continuous line of light. End caps and mounting clips complete the installation. The 3-metre length is ideal for longer runs along shelves, counters, cove ceilings, and architectural features where seamless, uninterrupted lighting is desired."
  },
  {
    "id": "6985017b346d6159eee7f1f9",
    "title": "3phase 63A 4pole voltage protector",
    "slug": "3phase-63a-4pole-voltage-protector",
    "productType": "simple",
    "shortDescription": "63A 4-pole automatic voltage protector for three-phase equipment against over/under voltage.",
    "description": "The 3-Phase 63A 4-Pole Voltage Protector continuously monitors all three phases and neutral for dangerous over-voltage, under-voltage, phase imbalance, and phase loss conditions. When any parameter exceeds safe limits, it disconnects the load within milliseconds to prevent damage to expensive three-phase machinery such as motors, compressors, and industrial equipment. Once voltage returns to normal, it reconnects automatically after a configurable delay. The 63A rating handles substantial commercial and light industrial loads. DIN-rail mounted with an LED display showing real-time voltage readings for each phase, it provides both protection and monitoring in one device."
  },
  {
    "id": "6985014c346d6159eee7f193",
    "title": "3phase AVS",
    "slug": "3phase-avs",
    "productType": "simple",
    "shortDescription": "Three-phase automatic voltage switcher (AVS) to protect equipment from mains voltage fluctuations.",
    "description": "The 3-Phase AVS (Automatic Voltage Switcher) safeguards three-phase electrical installations from damaging voltage fluctuations that are common on unstable power grids. It monitors all three phases in real time and automatically disconnects the supply if the voltage rises too high or drops too low, reconnecting once conditions stabilise. This protects motors, refrigeration compressors, lifts, water pumps, and other three-phase equipment from burnout caused by sustained over-voltage or under-voltage. Compact DIN-rail design fits neatly in distribution boards alongside your MCBs and contactors."
  },
  {
    "id": "6984ff83346d6159eee7ed67",
    "title": "4 Pole DC MCB 250",
    "slug": "4-pole-dc-mcb-250",
    "productType": "variable",
    "shortDescription": "4-pole 250V DC miniature circuit breaker for high-current solar battery and inverter protection.",
    "description": "The 4-Pole DC MCB 250V provides comprehensive overcurrent protection for DC circuits in solar power systems with battery banks and inverters. The four-pole configuration allows protection of both positive and negative lines on dual battery strings or higher-voltage DC bus configurations. Rated at 250V DC, it is suitable for 48V and 96V battery systems commonly found in larger off-grid and hybrid solar installations. Available in multiple current ratings to match your system requirements. DIN-rail mountable for standard enclosure and distribution board installation, it ensures safe, code-compliant DC circuit protection."
  },
  {
    "id": "69850051346d6159eee7ef1b",
    "title": "45Acoocker unit",
    "slug": "45acoocker-unit",
    "productType": "simple",
    "shortDescription": "45A cooker control unit with switched socket for safe, dedicated electric cooker connections.",
    "description": "This 45A Cooker Unit provides a dedicated, high-current switching point for electric cookers, ovens, and hobs. The 45-amp double-pole switch completely isolates the cooker circuit for safe maintenance and cleaning, while the integrated 13A switched socket below offers a convenient power point for smaller kitchen appliances like kettles and toasters. A neon indicator light confirms when the cooker circuit is live. The unit mounts on a standard double patress box and is wired on its own dedicated circuit from the distribution board, as required by electrical installation regulations."
  },
  {
    "id": "6984ffb9346d6159eee7edc9",
    "title": "4T Enershower",
    "slug": "4t-enershower",
    "productType": "simple",
    "shortDescription": "4-temperature Enershower instant electric shower head for hot water without a geyser.",
    "description": "The 4T Enershower is an instant electric shower head that heats water on demand as it flows through, eliminating the need for a separate water heater or geyser. With four temperature settings — from cold to extra hot — you can dial in your preferred shower comfort regardless of the season. It connects directly to your cold water supply and a dedicated electrical circuit, making installation simple and affordable compared to traditional hot water systems. The compact shower head fits standard plumbing fittings and includes a built-in thermal safety cutoff to prevent overheating. Perfect for homes, rental units, and guest houses looking for an economical hot water solution."
  },
  {
    "id": "69850220346d6159eee7f361",
    "title": "4ft floor trunking",
    "slug": "4ft-floor-trunking",
    "productType": "simple",
    "shortDescription": "4-foot floor cable trunking for routing power and data cables across open floor areas.",
    "description": "This 4ft Floor Trunking provides a safe, organised pathway for routing electrical and data cables across floors in offices, showrooms, and commercial spaces where cables need to cross open areas without creating trip hazards. The low-profile design with a flat, rounded top allows foot traffic and even light trolley loads to pass over safely. The snap-on lid opens for easy cable access during installation and future additions. Made from durable PVC or metal depending on the variant, it protects cables from damage while keeping the workspace tidy and compliant with health and safety regulations."
  },
  {
    "id": "6985006a346d6159eee7ef63",
    "title": "4p 100A ATS",
    "slug": "4p-100a-ats",
    "productType": "simple",
    "shortDescription": "4-pole 100A automatic transfer switch for seamless changeover between mains and generator or solar.",
    "description": "The 4-Pole 100A ATS (Automatic Transfer Switch) provides seamless, hands-free switching between two power sources — typically mains electricity and a standby generator or solar inverter system. When the primary source fails, the ATS detects the outage and automatically transfers the load to the backup source within seconds, then switches back when mains power is restored. The 100A rating handles entire residential buildings, shops, and small commercial premises. The 4-pole design switches all three phases plus neutral, ensuring complete isolation and safe transfer. DIN-rail or panel-mountable for installation in main distribution boards."
  },
  {
    "id": "698500d6346d6159eee7f03c",
    "title": "4pole 32A DC mcb",
    "slug": "4pole-dc-mcb",
    "productType": "variable",
    "shortDescription": "4-pole 32A DC miniature circuit breaker for multi-string solar and battery system protection.",
    "description": "The 4-Pole 32A DC MCB offers robust overcurrent protection for DC circuits in solar PV and battery storage systems. With four poles, it can protect both positive and negative conductors of two separate DC circuits or a high-voltage DC bus, making it suitable for combiner boxes and battery distribution boards. The 32A rating handles individual panel strings and battery bank connections in residential and small commercial solar installations. DIN-rail mountable, available in variable configurations to match different voltage ratings and system setups. A dependable safety device that prevents wiring damage and fire from short circuits or overloads."
  },
  {
    "id": "69850199346d6159eee7f241",
    "title": "4pole 63A motorized Ats",
    "slug": "4pole-63a-motorized-ats",
    "productType": "simple",
    "shortDescription": "4-pole 63A motorised automatic transfer switch for reliable three-phase power changeover.",
    "description": "This 4-Pole 63A Motorised ATS uses an electric motor-driven mechanism to switch between two power sources — mains and generator or solar inverter — automatically and reliably. The motorised design provides smoother, faster changeover compared to solenoid-based switches and handles higher switching cycles without contact wear. At 63A, it is sized for medium residential buildings, small offices, and retail premises running on three-phase power. The 4-pole configuration ensures all three phases and neutral are switched together for complete source isolation. Built-in voltage monitoring detects mains failure and restoration, triggering the transfer automatically."
  },
  {
    "id": "698505bb346d6159eee7f7ef",
    "title": "4pole ac spd",
    "slug": "4pole-ac-spd",
    "productType": "simple",
    "shortDescription": "4-pole AC surge protection device for three-phase installations against lightning and power surges.",
    "description": "The 4-Pole AC SPD provides surge protection across all three phases and neutral in a three-phase electrical installation. Lightning strikes, switching transients, and grid disturbances can send destructive voltage spikes through the mains supply, damaging expensive equipment like motors, PLCs, computer networks, and medical devices. This SPD diverts those surges safely to earth, keeping downstream equipment safe. Each pole module features a visual status indicator so you can confirm protection is active at a glance. DIN-rail mountable for clean installation in three-phase distribution boards alongside your MCBs and RCDs."
  },
  {
    "id": "6984ffc6346d6159eee7eddb",
    "title": "550W Solar Panel  Voltage 499 vdc",
    "slug": "550w-solar-panel-voltage-499-vdc",
    "productType": "simple",
    "shortDescription": "550W monocrystalline solar panel rated at 499V DC for high-efficiency commercial solar installations.",
    "description": "This 550W Solar Panel is a high-wattage monocrystalline module designed for maximum energy harvest per square metre, making it ideal for commercial rooftop installations, solar farms, and large residential systems. With an open-circuit voltage of approximately 499V DC, it is optimised for string inverter configurations that operate at higher voltages for improved system efficiency and reduced cable losses. The large-format cells and half-cut cell technology deliver excellent performance even in partial shading conditions. A robust anodised aluminium frame and tempered glass front withstand hail, wind, and decades of outdoor exposure, backed by industry-standard power output warranties."
  },
  {
    "id": "698501c0346d6159eee7f289",
    "title": "5w Garden Solar Lights",
    "slug": "5w-garden-solar-lights",
    "productType": "simple",
    "shortDescription": "5W solar-powered garden lights for pathway, lawn, and landscape decoration.",
    "description": "These 5W Solar Garden Lights add warm, inviting illumination to your outdoor spaces without any wiring or electricity costs. Each light features a small solar panel on top that charges the built-in rechargeable battery during the day and automatically switches on at dusk. The 5W LED provides a soft, pleasant glow that beautifully highlights garden paths, flower beds, driveways, and lawn edges. Waterproof construction ensures reliable operation through rain and harsh weather. Simply push the stake into the ground where you want light — no electrician needed. Ideal for creating ambiance in gardens, courtyards, and hospitality venues."
  },
  {
    "id": "698502cc346d6159eee7f62d",
    "title": "5w solar garden lamps",
    "slug": "5w-solar-garden-lamps",
    "productType": "simple",
    "shortDescription": "5W solar garden lamp with decorative design for outdoor landscaping and pathway lighting.",
    "description": "Brighten your garden with these elegant 5W Solar Garden Lamps, which combine decorative design with practical solar-powered lighting. The integrated solar cell harvests sunlight to charge the internal battery, providing several hours of automatic illumination each evening. The 5W LED output is bright enough to light pathways and highlight landscape features while maintaining a warm, relaxing atmosphere. Durable weatherproof materials resist UV fading, rust, and rain, ensuring the lamps look great and function reliably season after season. Easy ground-stake installation means you can rearrange your lighting layout whenever you like."
  },
  {
    "id": "698501db346d6159eee7f2e3",
    "title": "5way Ht5 enclosure boxes",
    "slug": "5way-ht5-enclosure-boxes",
    "productType": "simple",
    "shortDescription": "5-way HT5 enclosure box for housing up to 5 DIN-rail mounted circuit breakers or devices.",
    "description": "The 5-Way HT5 Enclosure Box is a compact electrical enclosure designed to house up to five DIN-rail mounted devices such as MCBs, RCDs, surge protectors, and contactors. It provides a neat, protected environment for small distribution boards in apartments, individual circuits, and sub-distribution applications. The hinged or removable cover protects the devices from dust and accidental contact, while cable entry knockouts on the top and bottom allow flexible conduit and cable routing. Surface-mountable on walls, it is an essential component for organising and protecting circuit protection devices in any electrical installation."
  },
  {
    "id": "698506a2346d6159eee7f899",
    "title": "600mm by 600mm recess led panel",
    "slug": "600mm-by-600mm-recess-led-panel",
    "productType": "simple",
    "shortDescription": "600x600mm recessed LED panel for standard suspended ceiling grids in offices and commercial buildings.",
    "description": "This 600mm x 600mm Recessed LED Panel is a direct drop-in replacement for standard 2x2 foot suspended ceiling tiles, making it the go-to lighting solution for offices, hospitals, schools, banks, and retail spaces using T-grid ceiling systems. The edge-lit LED technology produces bright, uniform, flicker-free illumination across the entire panel surface, reducing eye strain and improving workplace comfort. Consuming significantly less power than the fluorescent troffers it replaces, it delivers substantial electricity savings over its long lifespan. Slim and lightweight, it installs quickly into the existing ceiling grid without any structural modifications."
  },
  {
    "id": "69850695346d6159eee7f887",
    "title": "600mm by 600mm ssurface panel light",
    "slug": "600mm-by-600mm-ssurface-panel-light",
    "productType": "simple",
    "shortDescription": "600x600mm surface-mounted LED panel light for ceilings without a suspended grid system.",
    "description": "The 600mm x 600mm Surface-Mounted LED Panel Light delivers the same bright, even illumination as recessed panels but installs directly onto concrete or plastered ceilings using a surface-mount frame kit. This makes it perfect for offices, classrooms, and commercial spaces that do not have suspended ceiling grids. The large panel area produces generous, shadow-free light coverage, significantly outperforming individual tube lights or downlights. Energy-efficient LED technology dramatically reduces electricity consumption compared to fluorescent lighting, while the long service life of 50,000+ hours means fewer replacements and lower maintenance costs."
  },
  {
    "id": "698502a7346d6159eee7f58b",
    "title": "630A 4pole Ats",
    "slug": "630a-4pole-ats",
    "productType": "simple",
    "shortDescription": "630A 4-pole automatic transfer switch for heavy-duty commercial and industrial power changeover.",
    "description": "The 630A 4-Pole ATS is a heavy-duty automatic transfer switch built for large commercial buildings, factories, hospitals, and data centres that cannot afford any interruption in power supply. With a 630A rating, it handles massive electrical loads across all three phases plus neutral, automatically switching between mains power and large standby generators when an outage occurs. The motorised switching mechanism ensures fast, reliable changeover with minimal arc damage to contacts. Built-in voltage and frequency monitoring means the switch only transfers to the backup source once it has stabilised. Designed for panel mounting in main switchboard enclosures."
  },
  {
    "id": "698502aa346d6159eee7f59d",
    "title": "63A 2P SOLAR ATS",
    "slug": "63a-2p-ats",
    "productType": "simple",
    "shortDescription": "63A 2-pole automatic transfer switch for single-phase solar-to-mains changeover.",
    "description": "The 63A 2-Pole Solar ATS automatically switches your single-phase load between solar inverter power and mains electricity. When your solar system produces enough power, the ATS keeps you running on solar. When solar output drops or the battery runs low, it seamlessly transfers the load back to mains — and vice versa when solar returns. The 63A capacity handles the full electrical load of most residential homes. Two-pole switching isolates both live and neutral for safety. DIN-rail mountable, with adjustable voltage thresholds and transfer delay settings to match your specific system configuration."
  },
  {
    "id": "6985025c346d6159eee7f459",
    "title": "63A 3p Chint mcb",
    "slug": "63a-3p-chint-mcb",
    "productType": "simple",
    "shortDescription": "63A 3-pole Chint MCB for three-phase main circuit protection in commercial distribution boards.",
    "description": "The 63A 3-Pole Chint MCB is a high-quality three-phase circuit breaker from the globally trusted Chint brand. At 63 amps, it serves as a main incoming breaker in three-phase distribution boards for residential complexes, offices, and small industrial premises. The three-pole design protects all three phases simultaneously, tripping on overcurrent or short circuit in any phase. Chint’s proven thermal-magnetic trip mechanism provides reliable protection with long mechanical life. Compact DIN-rail mounting allows it to sit alongside other protection devices in standard enclosures and consumer units."
  },
  {
    "id": "69850160346d6159eee7f1a5",
    "title": "6mm steel core wire rope",
    "slug": "6mm-steel-core-wire-rope",
    "productType": "simple",
    "shortDescription": "6mm galvanised steel-core wire rope for guy wires, rigging, and overhead line support.",
    "description": "This 6mm Steel Core Wire Rope is a heavy-duty, galvanised cable used for guying utility poles, supporting overhead power lines, rigging solar panel mounting structures, and general lifting or tensioning applications. The steel core provides high tensile strength and resistance to stretching under load, while the galvanised coating protects against rust and corrosion in outdoor environments. The 6mm diameter offers a good balance between strength and flexibility, making it easy to handle and terminate with standard cable clamps, thimbles, and turnbuckles. Sold by the metre for custom-length requirements."
  },
  {
    "id": "69850013346d6159eee7ee83",
    "title": "6mtrs Telescopic hot stick",
    "slug": "6mtrs-telescopic-hot-stick",
    "productType": "simple",
    "shortDescription": "6-metre telescopic insulated hot stick for safe live-line electrical work at height.",
    "description": "The 6-Metre Telescopic Hot Stick is an essential safety tool for electricians and line workers who need to operate switches, replace fuses, or handle equipment on live power lines from a safe distance. The telescopic design extends to 6 metres and collapses down for easy transport and storage. Made from fibreglass-reinforced insulating material, it provides high dielectric strength to protect the operator from electric shock when working on energised conductors. The universal fitting end accepts various tool attachments including prong disconnectors, tie sticks, and fuse pullers. A critical piece of PPE for utility crews and industrial electricians."
  },
  {
    "id": "69850646346d6159eee7f83f",
    "title": "6w led recess panel",
    "slug": "6w-led-recess-panel",
    "productType": "simple",
    "shortDescription": "6W recessed LED panel light for general-purpose downlighting in ceilings.",
    "description": "This 6W Recessed LED Panel is a mid-size flush-mount downlight that strikes the perfect balance between brightness and energy efficiency for everyday rooms. At 6 watts, it provides comfortable illumination for bedrooms, living rooms, and small office spaces without the harsh glare of higher-wattage fixtures. The round panel installs into a standard ceiling cutout with spring clips, sitting flush for a clean, modern appearance. With an LED lifespan of up to 50,000 hours and very low heat output, it is a fit-and-forget lighting solution that pays for itself in energy savings."
  },
  {
    "id": "69850027346d6159eee7eeaf",
    "title": "8\"  Wooden Hoocked Climbers",
    "slug": "8-wooden-hoocked-climbers",
    "productType": "simple",
    "shortDescription": "8-inch hooked wooden pole climbers for ascending treated timber utility poles.",
    "description": "These 8-inch Hooked Wooden Pole Climbers are designed for linemen who need to ascend creosote-treated timber utility poles for power line installation, maintenance, and repair. The 8-inch gaffs (spurs) penetrate the wood surface to provide a secure foothold, while the hooked design gives extra grip on the pole. Adjustable leather or nylon straps secure the climbers to the lineman’s boots and legs for a stable, comfortable fit during prolonged climbing. Made from hardened steel for durability and repeated use, they are a fundamental piece of equipment for any utility line crew working with wooden poles."
  },
  {
    "id": "69850232346d6159eee7f3a7",
    "title": "800w solar digital meter",
    "slug": "product",
    "productType": "simple",
    "shortDescription": "800W solar digital meter for monitoring power generation, voltage, and current in PV systems.",
    "description": "The 800W Solar Digital Meter provides real-time monitoring of your solar panel output, displaying key parameters such as voltage, current, power (watts), and cumulative energy generated (kWh). With an 800W maximum measurement range, it is sized for small to medium residential solar systems. The clear digital LCD display makes it easy to check your system’s performance at a glance, helping you identify issues like shading, dirty panels, or wiring faults before they become costly problems. Compact and easy to wire inline on the DC side of your solar installation, it is a valuable diagnostic and monitoring tool for any solar system owner."
  },
  {
    "id": "69850277346d6159eee7f4c5",
    "title": "8way 3phase distribution board",
    "slug": "8way-3phase-distribution-board",
    "productType": "simple",
    "shortDescription": "8-way three-phase distribution board for organising circuit protection in commercial installations.",
    "description": "The 8-Way 3-Phase Distribution Board is a metal or thermoplastic enclosure that houses up to eight DIN-rail mounted circuit breakers across three phases. It is the central point for distributing power to individual circuits in offices, shops, workshops, and small industrial premises. The three-phase bus bar system ensures balanced load distribution, and the pre-punched knockouts allow neat cable entry from the top or bottom. Internal DIN rails accommodate MCBs, RCDs, contactors, and other modular devices. A lockable door or cover protects the internal components from dust and unauthorised access. Complete with neutral and earth terminal bars."
  },
  {
    "id": "69850761346d6159eee7f905",
    "title": "Adjustable Voltage Protector 63A Single Phase 2 Poles",
    "slug": "adjustable-voltage-protector-63a-single-phase-2-poles",
    "productType": "simple",
    "shortDescription": "63A adjustable single-phase voltage protector with digital display for customisable over/under voltage protection.",
    "description": "The 63A Adjustable Voltage Protector monitors your single-phase mains supply and automatically disconnects the load when voltage rises above or drops below your preset thresholds. Unlike fixed-threshold protectors, this unit features adjustable upper and lower voltage limits, reconnection delay time, and display of real-time voltage and current on a built-in digital screen. At 63A, it protects an entire household or small business from the damage caused by power surges, brownouts, and voltage instability common on many power grids. The 2-pole design isolates both live and neutral. DIN-rail mountable for professional distribution board installation."
  },
  {
    "id": "6985003e346d6159eee7eee5",
    "title": "Armoured cable 2/3/4 Core 1.5/2.5mm",
    "slug": "armoured-cable-2-3-4-core-1-5-2-5mm",
    "productType": "variable",
    "shortDescription": "Steel wire armoured (SWA) cable in 2, 3, and 4-core variants with 1.5mm or 2.5mm conductors.",
    "description": "Steel Wire Armoured (SWA) Cable is the standard choice for underground power distribution, outdoor wiring, and installations where cables need mechanical protection without conduit. Available in 2-core, 3-core, and 4-core configurations with 1.5mm² or 2.5mm² copper conductors, it covers a wide range of applications from garden lighting circuits to sub-main feeds between buildings. The steel wire armouring layer provides excellent protection against crushing, impact, and rodent damage. PVC inner and outer sheaths ensure moisture resistance and electrical insulation. Suitable for direct burial, surface cleat mounting, or installation in cable trays. Sold by the metre."
  },
  {
    "id": "69850065346d6159eee7ef51",
    "title": "Automatic Changeover Switch",
    "slug": "automatic-changeover-switch",
    "productType": "variable",
    "shortDescription": "Automatic changeover switch for seamless switching between mains and backup power sources.",
    "description": "The Automatic Changeover Switch detects mains power failure and automatically transfers your electrical load to a standby generator, solar inverter, or alternative power source. When mains power is restored, it switches the load back without any manual intervention. This ensures continuous power supply to critical loads with minimal interruption. Available in multiple current ratings and pole configurations to suit single-phase and three-phase installations, it is an essential component for homes, businesses, and institutions that rely on backup power systems. Features adjustable voltage sensing thresholds and reconnection delay timers for safe, reliable operation."
  },
  {
    "id": "69850047346d6159eee7ef09",
    "title": "Bell Switch",
    "slug": "bell-switch",
    "productType": "simple",
    "shortDescription": "Momentary bell push switch for activating doorbells and buzzers at entrances.",
    "description": "The Bell Switch is a spring-return momentary push button designed for activating electric doorbells, buzzers, and chimes. Press the button to ring the bell; release and the circuit opens again. The flush-mounted design fits standard patress boxes and matches common switch plate styles for a coordinated look with your other switches and sockets. Built with durable contacts rated for thousands of operations, it is suitable for residential front doors, office reception areas, and commercial entrances. Simple to wire with just two terminals, it works with both wired doorbells and low-voltage buzzer systems."
  },
  {
    "id": "6984fff8346d6159eee7ee4e",
    "title": "Car Jamper Kit",
    "slug": "car-jamper-kit",
    "productType": "simple",
    "shortDescription": "Portable car jump starter kit with built-in power bank for emergency vehicle battery boosting.",
    "description": "The Car Jumper Kit is a compact, portable jump starter that revives dead car batteries without needing another vehicle. The built-in high-discharge lithium battery delivers a powerful burst of current to crank your engine in seconds. Beyond jump starting, it doubles as a portable power bank with USB ports for charging phones, tablets, and other devices on the go. Many models also include an LED flashlight with SOS mode for roadside emergencies. Small enough to store in your glove compartment or boot, it is an essential piece of emergency equipment for every car owner, especially during cold mornings or after leaving lights on overnight."
  },
  {
    "id": "698500b0346d6159eee7eff4",
    "title": "Chicken Heat Bulb",
    "slug": "chicken-heat-bulb",
    "productType": "simple",
    "shortDescription": "Infrared heat lamp bulb for brooding chicks and keeping poultry warm in cold weather.",
    "description": "The Chicken Heat Bulb is an infrared heat lamp designed to provide consistent warmth for brooding chicks, ducklings, and other young poultry during their first weeks of life when they cannot regulate their own body temperature. The infrared radiation warms the birds directly rather than heating the air, making it efficient even in drafty poultry houses. The red-tinted glass reduces visible light to create a calmer environment that discourages pecking. It fits standard E27 lamp holders and is used with a brooder lamp reflector suspended at the correct height above the chick area. Also useful for keeping adult poultry warm in extremely cold conditions."
  },
  {
    "id": "69850019346d6159eee7ee9d",
    "title": "Concrete Pole Climber",
    "slug": "concrete-pole-climber",
    "productType": "variable",
    "shortDescription": "Concrete pole climbing spurs for safely ascending reinforced concrete utility poles.",
    "description": "Concrete Pole Climbers are specialised climbing spurs designed for ascending concrete utility poles, which are the standard in many power distribution networks. Unlike wooden pole climbers, these feature hardened steel gaffs shaped and angled to grip the rough surface of concrete poles securely. Adjustable leg straps and shin pads provide a comfortable, stable fit during extended climbing sessions. Available in different gaff lengths and strap configurations to suit various pole diameters and personal preferences. Essential equipment for linemen, electricians, and telecommunications technicians who regularly work at height on concrete poles."
  },
  {
    "id": "69850735346d6159eee7f8f3",
    "title": "Crimping Tool 6mm-50mm",
    "slug": "product-6",
    "productType": "simple",
    "shortDescription": "Hydraulic or ratchet crimping tool for crimping cable lugs and terminals from 6mm² to 50mm².",
    "description": "This Crimping Tool handles cable lugs and terminals ranging from 6mm² to 50mm², covering the most common conductor sizes used in residential, commercial, and solar electrical installations. The ratchet or hydraulic mechanism ensures consistent, high-pressure crimps that create secure, low-resistance connections — critical for safety and performance in high-current circuits. Interchangeable die sets match the hexagonal crimp profiles required for different lug sizes. The ergonomic handles reduce hand fatigue during repetitive crimping tasks. An indispensable tool for any electrician or solar installer who needs professional-quality cable terminations."
  },
  {
    "id": "698500e0346d6159eee7f060",
    "title": "DP Switch",
    "slug": "dp-switch",
    "productType": "variable",
    "shortDescription": "Double-pole (DP) isolating switch for safely disconnecting high-power appliances.",
    "description": "The DP Switch (Double-Pole Switch) provides complete isolation of both the live and neutral conductors for high-power appliances such as water heaters, immersion heaters, air conditioning units, and electric cookers. A neon indicator light shows when the circuit is live for added safety. Available in multiple current ratings to match your appliance requirements, it is typically mounted near the appliance it controls for quick access. The switch fits standard wall-mount patress boxes and features a robust rocker mechanism rated for thousands of switching cycles. A regulatory requirement for any dedicated appliance circuit that needs local isolation."
  },
  {
    "id": "69850074346d6159eee7ef75",
    "title": "Digital Timer",
    "slug": "digital-timer",
    "productType": "simple",
    "shortDescription": "Programmable digital timer switch for automated on/off control of lights, pumps, and appliances.",
    "description": "The Digital Timer is a programmable DIN-rail mounted switch that automatically turns electrical circuits on and off at times you set. Program multiple on/off events per day with minute-level precision, with options for daily, weekly, or custom schedules. Use it to automate outdoor lighting, water pumps, signage, heating systems, and any electrical load that runs on a predictable schedule. The digital LCD display shows the current time and programmed events, and a built-in battery backup retains your settings during power outages. Far more accurate and flexible than mechanical timers, it helps save electricity by ensuring equipment only runs when needed."
  },
  {
    "id": "6984ff6c346d6159eee7ed33",
    "title": "Double Pole (2p)20A,32A,63A 2p dc mcb",
    "slug": "__trashed",
    "productType": "simple",
    "shortDescription": "Double-pole DC MCB available in 20A, 32A, and 63A ratings for solar and battery circuit protection.",
    "description": "This Double-Pole DC MCB is available in 20A, 32A, and 63A current ratings, covering a wide range of DC circuit protection needs in solar PV and battery systems. The double-pole design disconnects both positive and negative conductors simultaneously, which is essential for safe DC circuit isolation since DC current does not have a natural zero-crossing point for arc extinguishing. Whether you are protecting individual panel strings, charge controller inputs, or battery bank connections, this MCB provides reliable overcurrent and short-circuit protection. DIN-rail mountable for installation in solar combiner boxes and DC distribution boards."
  },
  {
    "id": "6984ff7c346d6159eee7ed54",
    "title": "Double Pole d/p DC MCB 250",
    "slug": "duuble-pole-dc-mcb-250-2",
    "productType": "variable",
    "shortDescription": "Double-pole 250V DC MCB for protecting 48V and 96V battery systems and DC distribution circuits.",
    "description": "The Double-Pole 250V DC MCB provides overcurrent and short-circuit protection for DC circuits operating at up to 250 volts. This makes it suitable for 48V and 96V battery bank systems, DC bus bars, and inverter input circuits commonly found in medium-sized off-grid and hybrid solar installations. The double-pole configuration ensures both the positive and negative conductors are interrupted simultaneously during a fault, providing complete circuit isolation. Available in multiple current ratings to precisely match your circuit requirements, it mounts on standard DIN rails in enclosure boxes and DC distribution boards."
  },
  {
    "id": "69850043346d6159eee7eef7",
    "title": "Earthrod",
    "slug": "earthrod",
    "productType": "simple",
    "shortDescription": "Copper-bonded earth rod for establishing a reliable electrical earthing connection.",
    "description": "The Earth Rod is a copper-bonded steel rod driven into the ground to create a low-resistance path to earth for electrical fault currents. Proper earthing is a fundamental safety requirement in every electrical installation, protecting people from electric shock and equipment from damage caused by insulation faults and lightning strikes. The copper bonding resists corrosion in soil for a long service life, while the steel core provides the strength needed for driving into hard ground. Used together with earth clamps and earthing conductors, it connects your installation’s earth terminal to the mass of the earth. Essential for homes, commercial buildings, solar installations, and lightning protection systems."
  },
  {
    "id": "6985002c346d6159eee7eec1",
    "title": "Electrical Cable Twin earth 1.5/2.5/4.0/6.0mm",
    "slug": "electrical-cable-twin-earth-1-5-2-5-4-0-6-0mm",
    "productType": "variable",
    "shortDescription": "Twin and earth PVC cable in 1.5mm, 2.5mm, 4.0mm, and 6.0mm sizes for domestic and commercial wiring.",
    "description": "Twin and Earth Cable is the standard wiring cable used in domestic and commercial electrical installations throughout East Africa. It contains two insulated copper conductors (live and neutral) plus a bare earth conductor, all enclosed in a flat PVC outer sheath. Available in 1.5mm² for lighting circuits, 2.5mm² for socket ring mains, 4.0mm² for high-power appliances like cookers and showers, and 6.0mm² for sub-main feeds and heavy loads. The PVC insulation is flame-retardant and rated for indoor surface or concealed-in-conduit installation. Sold by the metre or in full rolls for complete wiring projects."
  },
  {
    "id": "698500ab346d6159eee7efe2",
    "title": "Flex Conduit",
    "slug": "flex-conduit",
    "productType": "variable",
    "shortDescription": "Flexible PVC or metal conduit for routing cables around curves and in hard-to-reach areas.",
    "description": "Flexible Conduit provides mechanical protection for electrical cables in situations where rigid conduit cannot be used — such as around corners, through moving joints, or in tight spaces behind machinery and equipment. Available in PVC (non-metallic) and galvanised metal variants, and in multiple diameters to suit different cable bundles. The corrugated or interlocking construction allows bending in any direction while maintaining cable protection. PVC flex conduit is lightweight and moisture-resistant, while metal flex conduit provides additional EMI shielding and fire resistance. Used in commercial fit-outs, factory wiring, HVAC connections, and any installation requiring adaptable cable routing."
  },
  {
    "id": "69850121346d6159eee7f115",
    "title": "Floatswitch",
    "slug": "floatswitch",
    "productType": "simple",
    "shortDescription": "Float switch for automatic water pump control based on tank or sump water level.",
    "description": "The Float Switch is an automatic level-sensing device that turns a water pump on or off based on the water level in a tank, well, or sump pit. As the water rises, the buoyant float tilts upward and either makes or breaks an electrical circuit, triggering the pump to start or stop. This eliminates the need for manual pump control and prevents both tank overflow and dry-running pump damage. Easy to install by suspending it in the tank at the desired trigger level, it works with single-phase submersible and surface water pumps. A simple, reliable, and affordable automation solution for domestic water supply, irrigation, and borehole pump systems."
  },
  {
    "id": "69850104346d6159eee7f0b0",
    "title": "Floodlight 20W / 30W / 50W /150W",
    "slug": "floodlight-20w-30w-50w-150w",
    "productType": "variable",
    "shortDescription": "LED floodlight available in 20W, 30W, 50W, and 150W for versatile outdoor and security lighting.",
    "description": "This LED Floodlight range offers powerful, energy-efficient outdoor illumination in four wattage options to match any application. The 20W suits doorways and small gardens, 30W covers driveways and signage, 50W illuminates car parks and building facades, and 150W lights up sports courts, warehouses, and large commercial areas. Each floodlight features a die-cast aluminium body with IP65 waterproof rating for all-weather outdoor use. The adjustable mounting bracket allows precise beam direction, and the high-quality LED chips deliver bright, consistent white light with excellent colour rendering. Connect to 240V mains power for immediate, reliable illumination."
  },
  {
    "id": "69850145346d6159eee7f181",
    "title": "Garden Led Stand",
    "slug": "garden-led-stand",
    "productType": "simple",
    "shortDescription": "Garden LED stand light for pathway and landscape illumination with a modern bollard design.",
    "description": "The Garden LED Stand is a sleek bollard-style outdoor light that adds both safety and style to garden pathways, driveways, patios, and landscape borders. Standing at a comfortable height, it casts a warm downward glow that lights the way without creating harsh glare. The weather-resistant construction withstands rain, sun, and dust exposure throughout the year. Powered by 240V mains, it connects to your outdoor lighting circuit for reliable, automatic operation with a timer or photocell. The modern design complements contemporary architecture and landscaping, making it a popular choice for residential estates, hotels, and commercial outdoor areas."
  },
  {
    "id": "6984ffd1346d6159eee7ee00",
    "title": "HA 8way solar Combiner box",
    "slug": "ha-8way-solar-combiner-box",
    "productType": "simple",
    "shortDescription": "8-way solar PV combiner box for consolidating multiple panel strings into a single DC output.",
    "description": "The HA 8-Way Solar Combiner Box is a pre-wired enclosure that consolidates up to eight individual solar panel string inputs into one or two combined DC outputs feeding your inverter. Each string input is protected by its own DC fuse or MCB, allowing you to isolate and maintain individual strings without shutting down the entire array. The weatherproof IP65 enclosure protects the internal components from rain and dust in rooftop or ground-mount installations. Clearly labelled terminals and a DIN-rail layout make installation and troubleshooting straightforward. An essential component for any multi-string solar PV system to ensure safe, organised DC cabling."
  },
  {
    "id": "698501de346d6159eee7f2f5",
    "title": "HT12 Way Enclosure Box",
    "slug": "ht12-way-enclosure-box",
    "productType": "simple",
    "shortDescription": "12-way enclosure box for housing MCBs, RCDs, and other DIN-rail protection devices.",
    "description": "The HT12 Way Enclosure Box accommodates up to twelve DIN-rail mounted devices, making it suitable for medium-size distribution boards in residential homes, apartments, and small commercial premises. It provides a protected, organised housing for MCBs, RCDs, surge protectors, contactors, and timers. The hinged or snap-on door prevents accidental contact with live components and keeps dust out. Multiple cable entry knockouts on the top and bottom allow flexible cable routing from different directions. Surface-mount installation with included screws and plugs. Neutral and earth terminal bars are included or available as accessories."
  },
  {
    "id": "698501d7346d6159eee7f2d1",
    "title": "HT18way solar enclosure box",
    "slug": "ht18way-solar-enclosure-box",
    "productType": "simple",
    "shortDescription": "18-way enclosure box for solar DC and AC distribution with space for comprehensive protection devices.",
    "description": "The HT18 Way Solar Enclosure Box provides ample space for up to eighteen DIN-rail modules, making it ideal for larger solar installations that require separate DC and AC protection devices, monitoring equipment, and switching components. It comfortably houses DC MCBs, DC surge protectors, DC disconnect switches, AC MCBs, AC SPDs, energy meters, and ATS modules in a single well-organised enclosure. The generous capacity eliminates the need for multiple smaller boxes, creating a cleaner, more professional installation. Weather-resistant construction with sealed cable entries suits both indoor plant rooms and sheltered outdoor mounting locations."
  },
  {
    "id": "6984ffda346d6159eee7ee12",
    "title": "HT8 way enclosure box",
    "slug": "ht8-way-enclosure-box",
    "productType": "simple",
    "shortDescription": "8-way DIN-rail enclosure box for small distribution boards and sub-panels.",
    "description": "The HT8 Way Enclosure Box houses up to eight DIN-rail mounted protection devices, fitting perfectly in small apartments, individual floors, or dedicated sub-circuits that need their own distribution point. Compact and wall-mountable, it provides a tidy, protected enclosure for MCBs, RCDs, and surge protectors without taking up excessive wall space. The snap-fit or hinged cover protects internal components and prevents accidental contact with live parts. Cable entry knockouts allow neat cable management, and the included DIN rail accommodates standard-width modular devices. A versatile, cost-effective solution for basic circuit distribution needs."
  },
  {
    "id": "6985000a346d6159eee7ee68",
    "title": "Half Body Safety Belt",
    "slug": "half-body-safety-belt",
    "productType": "simple",
    "shortDescription": "Half-body safety belt harness for fall protection during pole climbing and work at height.",
    "description": "The Half Body Safety Belt is a waist-and-leg harness designed for linemen, electricians, and technicians who work at height on utility poles, towers, and elevated structures. It secures around the waist and thighs, with a D-ring attachment point for connecting to a safety lanyard or positioning strap. Unlike a full-body harness, the half-body design offers greater freedom of movement while still providing reliable fall arrest protection for work within a limited height range. Adjustable buckle straps fit a range of body sizes, and padded waist sections improve comfort during extended use. A mandatory piece of PPE for anyone performing elevated electrical work."
  },
  {
    "id": "698501c7346d6159eee7f29b",
    "title": "Led Adjustable Gypsum Light",
    "slug": "led-adjustable-gypsum-light",
    "productType": "simple",
    "shortDescription": "Adjustable LED spotlight designed for flush installation in gypsum board ceilings.",
    "description": "The LED Adjustable Gypsum Light is a recessed spotlight that integrates seamlessly into gypsum plasterboard ceilings for a clean, architectural lighting scheme. The adjustable gimbal mechanism allows you to tilt and rotate the light beam to highlight specific areas, artwork, displays, or architectural features. Once installed, only the trimless light aperture is visible, creating a minimalist, high-end ceiling appearance. The LED module provides focused, bright illumination with excellent colour rendering, while consuming far less power than traditional halogen spotlights it replaces. Ideal for modern living rooms, showrooms, restaurants, and hotel interiors."
  },
  {
    "id": "698500a3346d6159eee7efbe",
    "title": "Led Bulb Head",
    "slug": "led-bulb-head",
    "productType": "variable",
    "shortDescription": "LED bulb head lamp holder available in different fitting types for ceiling and wall fixtures.",
    "description": "The LED Bulb Head is a lamp holder fitting designed to mount LED bulbs onto ceiling roses, wall brackets, and pendant cords. Available in different base types (E27, E14, B22) to match your bulb and fixture requirements, it provides a secure mechanical and electrical connection between the bulb and the wiring. The heat-resistant body ensures safe long-term operation even with higher-wattage bulbs. Simple screw-terminal wiring makes installation quick for any electrician. Use it as a replacement for a broken or outdated lamp holder, or in new installations where you need a basic, reliable bulb mounting point."
  },
  {
    "id": "698500dc346d6159eee7f04e",
    "title": "Led Bulbs",
    "slug": "led-bulbs",
    "productType": "variable",
    "shortDescription": "Energy-efficient LED bulbs available in various wattages and fittings for general lighting.",
    "description": "LED Bulbs are the modern replacement for traditional incandescent and CFL bulbs, delivering the same brightness at a fraction of the energy consumption. Available in various wattages (from 3W to 24W and above), colour temperatures (warm white, cool white, daylight), and base types (E27, E14, B22), they cover every general lighting need from bedrooms and living rooms to offices and retail spaces. Instant on with no warm-up time, flicker-free operation, and a lifespan of up to 25,000 hours make them the most practical and economical lighting choice. Each bulb pays for itself in electricity savings within months of installation."
  },
  {
    "id": "6985018f346d6159eee7f21d",
    "title": "Led Pendants",
    "slug": "led-pendants",
    "productType": "simple",
    "shortDescription": "Decorative LED pendant light fixtures for dining areas, counters, and stylish interior spaces.",
    "description": "LED Pendant Lights are suspended ceiling fixtures that combine functional illumination with decorative style. Hanging from an adjustable cord or chain, they create focused pools of light over dining tables, kitchen islands, bar counters, and reception desks while adding visual interest to the room. The integrated LED light source provides warm, inviting illumination with excellent energy efficiency and a long lifespan, eliminating the need for frequent bulb changes. Available in various modern designs to complement different interior themes, from minimalist industrial to sleek contemporary. Easy to install on standard ceiling roses or canopies."
  },
  {
    "id": "69850100346d6159eee7f09e",
    "title": "Lightening arrestor",
    "slug": "lightening-arrestor",
    "productType": "variable",
    "shortDescription": "Lightning arrestor for protecting electrical installations and equipment from direct and indirect lightning strikes.",
    "description": "The Lightning Arrestor is a critical protection device installed at the point of entry to an electrical installation to intercept and divert lightning-induced voltage surges safely to earth before they can damage internal wiring, appliances, and sensitive electronics. Available in different current and voltage ratings to suit residential, commercial, and industrial applications, it works in conjunction with proper earthing systems to provide comprehensive lightning protection. Especially important for buildings in lightning-prone areas and for solar installations where rooftop panels are highly exposed. DIN-rail mountable for clean integration into main distribution boards."
  },
  {
    "id": "69850111346d6159eee7f0d4",
    "title": "MC4 Connectors 2x1 / 3x1 / 4x1",
    "slug": "mc4-connectors-2x1-3x1-4x1",
    "productType": "variable",
    "shortDescription": "MC4 branch connectors in 2-to-1, 3-to-1, and 4-to-1 configurations for parallel solar panel wiring.",
    "description": "MC4 Branch Connectors allow you to connect multiple solar panel strings in parallel by merging two, three, or four MC4 cable outputs into a single MC4 output. The 2x1 combines two strings, the 3x1 combines three, and the 4x1 combines four. This eliminates the need for a combiner box in smaller installations and simplifies cable management on rooftops and ground-mount arrays. Each connector features IP67 waterproof-rated MC4 locking mechanism for secure, weatherproof connections that withstand years of outdoor exposure. Compatible with standard MC4 solar cables and panel connectors. Essential for any solar installation with multiple parallel-connected panel strings."
  },
  {
    "id": "69850173346d6159eee7f1d9",
    "title": "Metalic Cooker Unit",
    "slug": "metalic-cooker-unit",
    "productType": "simple",
    "shortDescription": "Metallic finish 45A cooker control unit with neon indicator and 13A switched socket.",
    "description": "This Metallic Cooker Unit features a brushed metal faceplate that gives a premium, durable finish matching other metallic switches and sockets in a coordinated range. The 45A double-pole switch provides safe isolation of the electric cooker circuit, with a red neon indicator confirming when the circuit is live. The integrated 13A switched socket below offers a handy power point for small kitchen appliances. The metallic construction is scratch-resistant and withstands the heat and grease common in kitchen environments better than standard plastic alternatives. Mounts on a double patress box and wires to a dedicated 6mm² circuit from the distribution board."
  },
  {
    "id": "6985016a346d6159eee7f1b7",
    "title": "Metallic Switch 1 gang / 2 gang / 3 gang / 4 gang",
    "slug": "metallic-switch-1-gang-2-gang-3-gang-4-gang",
    "productType": "variable",
    "shortDescription": "Metallic light switches available in 1, 2, 3, and 4 gang configurations for a premium wall finish.",
    "description": "These Metallic Switches feature a brushed or polished metal faceplate that adds a touch of elegance and durability to any room. Available in 1-gang, 2-gang, 3-gang, and 4-gang configurations to control one through four lighting circuits from a single wall plate, they suit everything from simple bedrooms to complex living areas with multiple light zones. The metal construction resists scratches, discolouration, and daily wear far better than plastic switches, making them ideal for high-traffic areas and premium interiors. Standard rocker mechanisms with secure screw terminals for reliable, long-lasting operation. Compatible with standard patress boxes."
  },
  {
    "id": "69850235346d6159eee7f3b9",
    "title": "Mid Clamp",
    "slug": "mid-clamp",
    "productType": "simple",
    "shortDescription": "Aluminium mid clamp for securing solar panels to mounting rails at the panel mid-point.",
    "description": "The Mid Clamp is an aluminium mounting accessory used to secure the middle edges of adjacent solar panels to the mounting rail. Positioned between two panels, a single mid clamp holds down one edge of each panel, creating a strong, wind-resistant bond to the racking structure. The anodised aluminium construction resists corrosion and UV degradation for decades of outdoor use. Quick to install with a single bolt, it speeds up array installation significantly. Available in heights matching common panel frame thicknesses (30mm, 35mm, 40mm). A simple but essential component — you will need several dozen for a typical rooftop solar installation."
  },
  {
    "id": "69850347346d6159eee7f6c9",
    "title": "Neon snakelight",
    "slug": "neon-snakelight",
    "productType": "simple",
    "shortDescription": "Flexible neon LED snake light for vibrant decorative and signage lighting effects.",
    "description": "The Neon Snake Light is a flexible LED tube that mimics the classic look of glass neon signs but with modern, energy-efficient LED technology. Its bendable silicone body can be shaped into letters, patterns, and curves to create eye-catching signage, decorative accents, and ambient lighting for shops, bars, restaurants, bedrooms, and event spaces. Unlike traditional neon, it runs cool to the touch, is shatter-proof, and consumes significantly less power. The uniform light output along the entire length produces a smooth, continuous glow without visible LED dots. Easy to mount with clips or adhesive backing for quick installation on walls, ceilings, and custom frames."
  },
  {
    "id": "6985011d346d6159eee7f103",
    "title": "Oil Room Heater",
    "slug": "oil-room-heater",
    "productType": "simple",
    "shortDescription": "Oil-filled electric radiator heater for safe, quiet, and efficient room warming.",
    "description": "The Oil Room Heater is an oil-filled electric radiator that provides gentle, even warmth through convection and radiant heat. The sealed oil columns heat up when the electric element is powered on and continue radiating warmth even after the heater switches off, providing efficient, residual heating. With no exposed elements or fans, it operates silently and does not dry out the air or blow dust — making it ideal for bedrooms, offices, and spaces where air quality and quiet operation matter. The built-in thermostat maintains your desired temperature automatically, and the portable design with castors allows easy movement between rooms. Overheating protection and tip-over safety switches provide peace of mind."
  },
  {
    "id": "698500f4346d6159eee7f07a",
    "title": "PV Cable",
    "slug": "pv-cable",
    "productType": "variable",
    "shortDescription": "UV-resistant solar PV cable in various sizes for connecting solar panels to inverters and combiner boxes.",
    "description": "Solar PV Cable is a specialised single-core cable designed for the DC wiring of photovoltaic systems. Its double-insulated construction with UV-resistant, weather-proof outer sheathing ensures it withstands decades of rooftop sun exposure, rain, and temperature extremes. The tinned copper conductor provides excellent corrosion resistance and low-resistance connections. Available in multiple cross-sectional sizes to handle different current loads and cable run lengths, from individual panel connections to main DC trunk cables. Compatible with MC4 connectors for quick, secure, tool-free connections. Certified for DC voltages up to 1000V or 1500V depending on the specification. Sold by the metre."
  },
  {
    "id": "698500fb346d6159eee7f08c",
    "title": "Patress",
    "slug": "patress",
    "productType": "variable",
    "shortDescription": "PVC patress boxes in single and double sizes for mounting switches and sockets on walls.",
    "description": "Patress Boxes (also called back boxes or pattress boxes) are the mounting enclosures behind switches, sockets, and other wiring accessories. They are surface-mounted onto the wall and provide a neat cavity for terminating cables and securing the faceplate. Available in single-gang and double-gang sizes, with different depths to accommodate the wiring space needed. Made from durable, flame-retardant PVC, they feature cable entry knockouts that can be broken out as needed. A fundamental component of every surface-wired electrical installation — you will need one behind every switch, socket, and cooker unit in the building."
  },
  {
    "id": "69850107346d6159eee7f0c2",
    "title": "Photocell",
    "slug": "photocell",
    "productType": "simple",
    "shortDescription": "Photocell light sensor for automatic dusk-to-dawn switching of outdoor lighting.",
    "description": "The Photocell is a light-sensitive switching device that automatically turns outdoor lights on at dusk and off at dawn, eliminating the need for manual switching or timers that require seasonal adjustment. It detects ambient light levels and switches a connected lighting circuit when the light drops below or rises above a set threshold. Easy to install on a wall, pole, or lighting fixture near the area it monitors, it connects in series with the lighting circuit. Use it to control compound lights, parking lot lights, signage illumination, and security lighting. A simple, maintenance-free automation device that ensures your lights are always on when needed and off when they are not."
  },
  {
    "id": "69850247346d6159eee7f413",
    "title": "Prepaid Energy Token Meters",
    "slug": "prepaid-energy-token-meters",
    "productType": "simple",
    "shortDescription": "Prepaid energy token meter for pay-as-you-go electricity metering in rental and commercial properties.",
    "description": "The Prepaid Energy Token Meter enables a pay-as-you-go electricity model where tenants or consumers purchase energy tokens (via phone, MPESA, or a vendor) and load them onto the meter to access a pre-purchased amount of kilowatt-hours. When the credit runs out, the supply disconnects until a new token is entered. This eliminates monthly billing disputes, ensures revenue collection for landlords and utility operators, and encourages energy conservation. The meter displays real-time consumption, remaining credit, and total usage. Ideal for rental apartments, hostels, market stalls, and any multi-tenant property where individual electricity billing is needed."
  },
  {
    "id": "6984ffcd346d6159eee7edee",
    "title": "Pv Fuse",
    "slug": "pv-fuse",
    "productType": "variable",
    "shortDescription": "DC-rated PV fuse for overcurrent protection of individual solar panel strings.",
    "description": "PV Fuses are DC-rated protective devices designed to interrupt overcurrent faults in solar photovoltaic circuits. Each fuse protects an individual panel string from reverse current flow and short circuits that could damage panels and wiring. Rated for high DC voltages (typically 1000V or 1500V), they are designed to safely interrupt DC arcs that standard AC fuses cannot handle. Available in multiple current ratings to match different panel string configurations, they install into compatible PV fuse holders mounted in combiner boxes. A simple, passive protection device that requires no power to operate — it just works when you need it most."
  },
  {
    "id": "6984fff4346d6159eee7ee3c",
    "title": "Recess Alluminium Profile",
    "slug": "recess-alluminium-profile",
    "productType": "variable",
    "shortDescription": "Recessed aluminium LED strip profile for flush-mount architectural lighting in ceilings and walls.",
    "description": "The Recessed Aluminium Profile is designed to be embedded into a routed channel in gypsum board, plaster, or timber surfaces, creating an elegant flush-mount housing for LED strip lights. The aluminium body dissipates heat from the LED strip to prolong its life, while the included opal diffuser produces a smooth, dot-free line of light. Available in multiple lengths and cross-section profiles to suit different installation depths and strip widths. Ideal for architectural cove lighting, under-cabinet illumination, staircase markers, and display shelving where a seamless, built-in lighting effect is desired. End caps and mounting hardware included."
  },
  {
    "id": "6985013e346d6159eee7f15d",
    "title": "Room Heater",
    "slug": "room-heater",
    "productType": "simple",
    "shortDescription": "Electric room heater for quick, portable warmth in bedrooms, offices, and living spaces.",
    "description": "This Electric Room Heater provides instant warmth wherever you need it. The compact, portable design allows you to move it between rooms and plug it into any standard wall socket. The adjustable thermostat lets you set your comfort level, and the heater cycles on and off to maintain it. Built-in safety features include overheat protection and a tip-over switch that automatically cuts power if the unit is knocked over. Ideal for cold mornings, chilly offices, and bedrooms in regions where evenings and nights get cold. A cost-effective way to heat the room you are in rather than running a whole-house heating system."
  },
  {
    "id": "69850142346d6159eee7f16f",
    "title": "Room Heater With Fun",
    "slug": "room-heater-with-fun",
    "productType": "simple",
    "shortDescription": "Electric room heater with built-in fan for accelerated heat distribution across the room.",
    "description": "This Room Heater with Fan combines a heating element with an integrated fan that blows warm air across the room for faster, more even heat distribution than convection-only heaters. The fan-assisted design warms up a space noticeably quicker, making it perfect for living rooms, offices, and shops where you need rapid comfort on cold days. Adjustable heat settings and a thermostat dial allow you to control the temperature, while a cool-air fan-only mode provides ventilation in warmer weather. Safety features include overheat cutoff and tip-over protection. Lightweight and portable, it can be moved wherever warmth is needed."
  },
  {
    "id": "6984ff5e346d6159eee7ed11",
    "title": "Single Pole s/p DC MCB 250",
    "slug": "single-pole-s-p-dc-mcb-250",
    "productType": "variable",
    "shortDescription": "Single-pole 250V DC MCB for protecting individual DC circuits in solar and battery systems.",
    "description": "The Single-Pole 250V DC MCB provides overcurrent and short-circuit protection for individual DC conductors in solar PV and battery installations. A single-pole design protects one conductor (typically the positive line), and is used where the negative is bonded to earth or where separate poles protect each conductor independently. The 250V DC rating is suitable for 12V, 24V, and 48V battery systems. Available in multiple current ratings to precisely size protection for your circuit. DIN-rail mountable and compact, it integrates easily into combiner boxes, charge controller enclosures, and DC distribution boards."
  },
  {
    "id": "69850056346d6159eee7ef2d",
    "title": "Single mcb breaker",
    "slug": "single-mcb-breaker",
    "productType": "variable",
    "shortDescription": "Single-pole AC miniature circuit breaker for individual circuit protection in distribution boards.",
    "description": "The Single MCB Breaker is the most common circuit protection device found in residential and commercial distribution boards. It protects a single circuit — such as a lighting ring, socket ring, or dedicated appliance feed — by automatically tripping when it detects overcurrent or a short-circuit fault. Available in multiple current ratings (6A, 10A, 16A, 20A, 32A, etc.) to match different circuit requirements, it mounts on a standard DIN rail and takes up just one module width in the board. The toggle handle provides clear on/off indication and allows manual isolation when maintenance is needed. An essential building block of every electrical distribution system."
  },
  {
    "id": "6985012c346d6159eee7f139",
    "title": "Smart Curtain Motors",
    "slug": "smart-curtain-motors",
    "productType": "simple",
    "shortDescription": "Smart motorised curtain track system with remote control and app integration for automated curtains.",
    "description": "Smart Curtain Motors transform your existing curtains into an automated, app-controlled system. The quiet electric motor attaches to a compatible curtain track and opens or closes your curtains at the touch of a button on a remote control, smartphone app, or voice command through smart home assistants. Set schedules to open curtains at sunrise and close them at sunset, or integrate with other smart home devices for scene-based automation. The motor operates quietly enough for bedrooms and living rooms. Perfect for hard-to-reach windows, tall curtains, and anyone who wants the convenience and energy-saving benefits of automated window coverings."
  },
  {
    "id": "69850173346d6159eee7f1d3",
    "title": "Socket metallic switch",
    "slug": "socket-metallic-switch",
    "productType": "variable",
    "shortDescription": "Metallic switch socket outlet available in single and double configurations for premium interiors.",
    "description": "The Socket Metallic Switch combines a switched power socket with a durable brushed metal faceplate for a premium look and feel. The metallic finish resists scratches, fingerprints, and daily wear, maintaining its appearance in high-traffic areas like kitchens, offices, and commercial spaces. Available in single and double socket configurations, each socket includes an individual on/off switch for convenient appliance control. The secure screw-terminal connections ensure safe, long-lasting wiring. Designed to fit standard patress boxes for straightforward installation or retrofit upgrades from plastic sockets."
  },
  {
    "id": "69850031346d6159eee7eed3",
    "title": "Solar Camera 4g Wifi  Enabled",
    "slug": "solar-camera-4g-wifi-enabled",
    "productType": "simple",
    "shortDescription": "Solar-powered security camera with 4G SIM and WiFi connectivity for remote surveillance anywhere.",
    "description": "The Solar Camera with 4G and WiFi is a completely wireless security camera powered by its own solar panel, making it ideal for locations with no electricity or internet connection — such as farms, construction sites, remote warehouses, and rural properties. The built-in 4G SIM card slot provides cellular data connectivity for live video streaming and alerts to your smartphone, while WiFi capability allows local network connection where available. Motion detection triggers instant push notifications and video recording to a cloud platform or onboard SD card. Night vision, two-way audio, and weatherproof construction ensure round-the-clock surveillance in all conditions. Truly install-anywhere security with zero running cables."
  },
  {
    "id": "69850204346d6159eee7f32b",
    "title": "Solar Ceiling Fun",
    "slug": "solar-ceiling-fun",
    "productType": "simple",
    "shortDescription": "DC-powered solar ceiling fan for off-grid ventilation and cooling in homes and workshops.",
    "description": "The Solar Ceiling Fan runs directly on DC power from a solar panel and battery system, providing cooling and air circulation in off-grid homes, cabins, workshops, and rural buildings where mains electricity is unavailable or unreliable. The efficient DC brushless motor consumes significantly less power than conventional AC ceiling fans, making the most of your limited solar energy. Multiple speed settings let you adjust airflow to your comfort level. The standard ceiling mount and blade design provide familiar performance and aesthetics. Pair it with a small solar panel and 12V battery for a completely self-contained cooling system that works even during daytime power outages."
  },
  {
    "id": "6985009c346d6159eee7efac",
    "title": "Solar Floodlight 60W / 100W / 200W /300W",
    "slug": "solar-floodlight-60w-100w-200w-300w",
    "productType": "variable",
    "shortDescription": "Solar-powered LED floodlight available in 60W, 100W, 200W, and 300W for zero-electricity outdoor lighting.",
    "description": "This Solar Floodlight range offers powerful outdoor illumination with no electricity bills and no wiring. Each unit comes with a separate solar panel connected by a cable, a high-capacity lithium battery, and an LED floodlight head. The solar panel charges the battery during the day, and the light operates automatically at night using the stored energy. Choose from 60W for gates and doorways, 100W for driveways and small compounds, 200W for car parks and sports areas, or 300W for large commercial spaces and perimeter security. A remote control adjusts brightness and timing modes. Weatherproof IP65 construction ensures reliable outdoor performance through all seasons."
  },
  {
    "id": "6985022b346d6159eee7f38d",
    "title": "Starlink Adaptor",
    "slug": "starlink-adaptor",
    "productType": "simple",
    "shortDescription": "Power adaptor for Starlink satellite internet dish, enabling alternative power supply connections.",
    "description": "The Starlink Adaptor allows you to power your Starlink satellite internet dish from alternative power sources or through non-standard power configurations. Whether you need to connect to a solar power system, a generator, or a different voltage supply, this adaptor bridges the gap between your power source and the Starlink hardware requirements. It is particularly useful in off-grid installations where the standard Starlink power supply may not be suitable for the available power infrastructure. Compact and robust, it ensures your Starlink internet connection stays online regardless of your power setup."
  },
  {
    "id": "69850223346d6159eee7f373",
    "title": "Starlink Kit",
    "slug": "starlink-kit",
    "productType": "simple",
    "shortDescription": "Complete Starlink satellite internet kit with dish, router, cables, and mounting hardware.",
    "description": "The Starlink Kit is a complete satellite internet system that delivers high-speed, low-latency internet to virtually any location on earth — even remote rural areas with no fibre, cable, or reliable mobile data coverage. The kit includes the Starlink dish (Dishy), a WiFi router, power supply, and all necessary cables and mounting hardware for a self-install setup. Simply place the dish with a clear view of the sky, connect the cables, and you are online within minutes. Starlink uses a constellation of low-earth-orbit satellites to provide speeds suitable for video calls, streaming, working from home, and running a business. Ideal for farms, lodges, rural homes, and remote work sites."
  },
  {
    "id": "698500b7346d6159eee7f006",
    "title": "TV Socket",
    "slug": "tv-socket",
    "productType": "simple",
    "shortDescription": "Coaxial TV aerial socket outlet for connecting television sets to antenna or cable TV signals.",
    "description": "The TV Socket is a wall-mounted coaxial outlet that provides a neat, permanent connection point for your television aerial or cable TV signal. It replaces dangling aerial cables with a clean, professional wall plate that matches your other switches and sockets. The coaxial connector accepts standard TV aerial plugs, and the socket wires to the incoming aerial cable from your rooftop antenna, satellite dish, or cable TV provider. Suitable for residential and commercial installations wherever a TV viewing point is needed. Mounts on a standard patress box for surface or flush installation."
  },
  {
    "id": "6985033c346d6159eee7f6b7",
    "title": "TV snakelight with USB port",
    "slug": "tv-snakelight-with-usb-port",
    "productType": "simple",
    "shortDescription": "Flexible LED snakelight with USB port for ambient TV backlighting and device charging.",
    "description": "The TV Snakelight with USB Port is a flexible LED light designed to sit behind or beside your television, providing soft ambient backlighting that reduces eye strain during evening viewing. The gooseneck design lets you direct the light exactly where needed, while the integrated USB port on the base doubles as a convenient charging point for phones, tablets, or other USB devices. Powered via a standard plug, it eliminates the need for a separate USB charger at your entertainment unit. Also useful as a reading light, desk lamp, or bedside light. The warm LED produces a gentle glow that enhances your viewing experience without adding glare to the screen."
  },
  {
    "id": "698501ee346d6159eee7f307",
    "title": "Twin Socket",
    "slug": "twin-socket",
    "productType": "simple",
    "shortDescription": "Double power socket outlet for connecting two appliances from a single wall point.",
    "description": "The Twin Socket provides two independent power outlets from a single wall-mounted faceplate, allowing you to plug in two appliances without using an extension lead or adaptor. Each socket accommodates a standard 3-pin plug. The robust construction and secure terminal connections ensure safe, reliable power delivery for everyday appliances such as TVs, lamps, chargers, and kitchen equipment. Designed to fit a standard double patress box, it installs neatly into new builds or replaces an existing double socket during renovations. A practical, space-efficient solution for any room that needs multiple power points."
  },
  {
    "id": "6985018b346d6159eee7f20b",
    "title": "Utility Knife",
    "slug": "utility-knife",
    "productType": "simple",
    "shortDescription": "Retractable utility knife for stripping cables, cutting insulation, and general electrical work.",
    "description": "The Utility Knife is an essential hand tool for electricians, solar installers, and general tradespeople. The retractable blade mechanism provides safe storage when not in use and extends quickly for tasks like stripping cable sheathing, cutting insulation tape, trimming conduit grommet edges, scoring drywall for patress box cutouts, and opening packaging. The ergonomic handle with a non-slip grip ensures comfortable, controlled cuts even during prolonged use. Standard trapezoidal blades are inexpensive and widely available, and the quick-change mechanism allows blade replacement without tools. A compact, belt-clip-ready design keeps it within reach at all times on the job site."
  },
  {
    "id": "6985076c346d6159eee7f917",
    "title": "WIDE PADDED WAIST SAFETY BELT",
    "slug": "wide-padded-waist-safety-belt",
    "productType": "simple",
    "shortDescription": "Wide padded safety belt for work positioning on poles, towers, and elevated structures.",
    "description": "The Wide Padded Waist Safety Belt is designed for linemen, electricians, and tower workers who spend extended periods working at height. The extra-wide belt distributes load across a larger area of the lower back and hips, significantly reducing fatigue and pressure points compared to narrow belts. Thick cushioned padding provides comfort during prolonged use. Reinforced stitching and a heavy-duty buckle ensure the belt holds securely under working loads. D-ring attachment points allow connection to a positioning lanyard for hands-free work on wooden, concrete, or metal poles. Meets safety standards for work positioning equipment. Essential PPE for anyone doing elevated electrical or telecom installations."
  },
  {
    "id": "6985016b346d6159eee7f1bb",
    "title": "Water Heater Switch",
    "slug": "water-heater-switch",
    "productType": "variable",
    "shortDescription": "Dedicated high-current switch for water heaters and geysers, available in various amp ratings.",
    "description": "The Water Heater Switch is a dedicated, high-current wall switch purpose-built for controlling electric water heaters (geysers), immersion heaters, and other high-draw appliances. Available in multiple amp ratings to match different heater sizes, it features a clearly visible on/off indicator so you always know when the heater is active — helping manage electricity consumption. The switch is designed with wider terminal connections and heavier contact plates than standard light switches, safely handling the sustained high current that water heaters draw. A neon indicator light provides at-a-glance confirmation. Mounts alongside other switches or on its own patress box near the geyser for convenient control."
  },
  {
    "id": "69850124346d6159eee7f127",
    "title": "Waterproof Twin Socket",
    "slug": "waterproof-twin-socket",
    "productType": "simple",
    "shortDescription": "IP-rated weatherproof double socket for outdoor and wet-area electrical installations.",
    "description": "The Waterproof Twin Socket provides two protected power outlets for outdoor, garage, workshop, and wet-area use. The spring-loaded cover flaps seal each socket when not in use, preventing rain, dust, and splashing water from reaching the electrical contacts. Suitable for gardens, patios, car washes, pool areas, and industrial yards where standard indoor sockets would be unsafe. The robust enclosure and gasket seals maintain weatherproof integrity even when mounted on exposed walls. Both sockets accept standard 3-pin plugs and provide the same reliable power delivery as indoor sockets, but with the added protection needed for harsh environments."
  },
  {
    "id": "6985071d346d6159eee7f8e1",
    "title": "Waterproof power supply 12v 700w",
    "slug": "product-5",
    "productType": "simple",
    "shortDescription": "700W waterproof 12V DC power supply for outdoor LED signage, strip lights, and lighting installations.",
    "description": "The Waterproof 12V 700W Power Supply is a high-capacity LED driver enclosed in a sealed aluminium housing for outdoor and damp-location use. It converts mains AC power to a stable 12V DC output capable of delivering up to 700 watts, making it suitable for large LED strip light installations, illuminated signage, architectural lighting, and other demanding 12V loads. The waterproof enclosure protects the electronics from rain, humidity, and dust, allowing permanent outdoor mounting. Built-in thermal protection and overcurrent safeguards ensure reliable long-term operation. Multiple output terminals allow connection to several LED channels from a single power supply, simplifying wiring in large lighting projects."
  },
  {
    "id": "6985026c346d6159eee7f48f",
    "title": "astraunant starry sky projector",
    "slug": "astraunant-starry-sky-projector",
    "productType": "simple",
    "shortDescription": "Astronaut-shaped starry sky projector lamp that fills rooms with a rotating galaxy light display.",
    "description": "The Astronaut Starry Sky Projector is a decorative LED light in the shape of a miniature astronaut that projects a moving galaxy of stars and nebula patterns onto your walls and ceiling. Rotate the astronaut's head and arms to aim the projection in any direction. Multiple colour modes and rotation speeds let you create the perfect ambiance for bedrooms, nurseries, home cinemas, or party spaces. The gentle, drifting starfield is calming for children at bedtime and a striking conversation piece for adults. Powered by USB, it connects to any phone charger, power bank, or laptop. Compact and lightweight, it works on a bedside table, shelf, or desk."
  },
  {
    "id": "6985027e346d6159eee7f4e9",
    "title": "aviation red light",
    "slug": "aviation-red-light",
    "productType": "simple",
    "shortDescription": "Red aviation obstruction light for marking tall structures and ensuring aircraft safety compliance.",
    "description": "The Aviation Red Light is a high-visibility obstruction light designed to be mounted on tall structures — communication towers, building rooftops, cranes, wind turbines, and high-rise construction sites — to alert aircraft of the obstruction. The steady or flashing red LED output meets aviation regulatory requirements for low-intensity obstruction lighting. Weatherproof construction withstands constant outdoor exposure at height, including wind, rain, UV radiation, and temperature extremes. Low power consumption and long LED life minimize maintenance visits to elevated, hard-to-access mounting locations. An essential safety compliance product for any structure that penetrates airspace boundaries."
  },
  {
    "id": "69850282346d6159eee7f4fb",
    "title": "aviation solar beam light",
    "slug": "aviation-solar-beam-light",
    "productType": "simple",
    "shortDescription": "Solar-powered aviation beam light for marking towers and tall structures without mains electricity.",
    "description": "The Aviation Solar Beam Light is a self-powered obstruction light that uses a built-in solar panel and rechargeable battery to operate independently of the electrical grid. Designed for marking communication towers, tall buildings, wind masts, and other elevated structures, it produces a high-intensity beam visible to aircraft at the distances required by aviation regulations. The solar panel charges the battery during daylight, and the light activates automatically at dusk. This eliminates the need to run power cables to the top of the structure, dramatically reducing installation cost and complexity. Weatherproof and maintenance-free for extended periods, it is the practical choice for remote or off-grid tower installations."
  },
  {
    "id": "698502ad346d6159eee7f5af",
    "title": "battery fuse 100A",
    "slug": "battery-fuse-100a",
    "productType": "simple",
    "shortDescription": "100A battery fuse for protecting high-current battery connections in solar and inverter systems.",
    "description": "The 100A Battery Fuse provides critical overcurrent protection for the high-current cable run between your battery bank and inverter. In solar and backup power systems, the battery-to-inverter connection carries the highest current in the entire system, and a short circuit or fault on this cable without fuse protection can cause catastrophic damage, fire, or battery rupture. This 100A rated fuse blows cleanly and quickly if current exceeds safe levels, disconnecting the battery before damage occurs. The bolt-down terminal design ensures solid, low-resistance connections at high current. An essential safety component that should be installed as close to the battery positive terminal as possible."
  },
  {
    "id": "698503a3346d6159eee7f72b",
    "title": "cabinet alluminium profile",
    "slug": "cabinet-alluminium-profile",
    "productType": "simple",
    "shortDescription": "Aluminium LED profile designed for mounting inside or beneath cabinets for concealed accent lighting.",
    "description": "The Cabinet Aluminium Profile is a slim, anodised aluminium channel specifically designed for mounting LED strip lights inside cupboards, under kitchen cabinets, inside wardrobes, and along shelving units. The profile houses the LED strip and protects it from physical damage, while the included frosted diffuser cover eliminates the dotted appearance of individual LEDs, producing a smooth, even line of light. End caps give the installation a professional, finished look. Available in lengths that can be cut to size on site. The aluminium body also acts as a heatsink, drawing heat away from the LED strip and extending its lifespan. Ideal for kitchen under-cabinet task lighting and display cabinet accent lighting."
  },
  {
    "id": "69850317346d6159eee7f695",
    "title": "camalong 2T",
    "slug": "product-4",
    "productType": "simple",
    "shortDescription": "2-tonne come-along hand winch puller for tensioning cables and pulling loads during installations.",
    "description": "The Camalong 2T is a 2-tonne capacity hand-operated ratchet cable puller (come-along) used by electricians, riggers, and construction workers for tensioning overhead power lines, pulling heavy cables through conduit runs, lifting equipment into position, and securing loads. The ratchet mechanism provides controlled, incremental pulling force that one person can operate safely. A steel wire rope and forged hooks ensure reliable grip on cables, chain links, or anchor points. The compact design is easy to carry to elevated or confined work locations. A locking mechanism holds the load in position when you stop cranking. An indispensable rigging tool for line installation and heavy pulling tasks."
  },
  {
    "id": "69850518346d6159eee7f7a7",
    "title": "concrete  climbers",
    "slug": "concrete-climbers",
    "productType": "external",
    "shortDescription": "Concrete pole climbing spikes for linemen working on concrete electrical and telecom poles.",
    "description": "Concrete Climbers are strap-on climbing spikes (gaffs) designed specifically for ascending concrete utility poles. Unlike wooden pole climbers, these feature hardened steel spikes shaped and angled to grip the textured surface of concrete poles securely. Adjustable leather or nylon leg straps and ankle pads ensure a snug, comfortable fit for extended climbing sessions. Used by electrical linemen, telecom technicians, and CCTV installers who need to reach equipment mounted on concrete poles where bucket trucks cannot access. Proper technique and a positioning belt (sold separately) are required for safe use. Built tough for daily professional use in all weather conditions."
  },
  {
    "id": "698502d2346d6159eee7f63f",
    "title": "fixed disco laser lights",
    "slug": "fixed-disco-laser-lights",
    "productType": "simple",
    "shortDescription": "Fixed-mount disco laser light projector for parties, events, and entertainment venues.",
    "description": "The Fixed Disco Laser Light projects a dazzling display of coloured laser beams, patterns, and shapes across your dance floor, walls, and ceiling. Designed for permanent or semi-permanent mounting in entertainment venues, bars, clubs, home party rooms, and event spaces, it activates automatically with sound-responsive mode that syncs the patterns to music beats, or runs in continuous auto-rotation mode. Multiple laser colours and pattern combinations create an immersive light show without the complexity or cost of a full stage lighting rig. Compact enough to mount on a wall bracket, ceiling hook, or tripod stand. Simply plug in, mount, and let the laser do the work at your next event."
  },
  {
    "id": "698502b9346d6159eee7f5e5",
    "title": "full body safety harness",
    "slug": "full-body-safety-harness",
    "productType": "simple",
    "shortDescription": "Full-body safety harness for fall arrest and work positioning at height.",
    "description": "The Full Body Safety Harness is an essential piece of personal protective equipment for anyone working at height — including solar panel installers on rooftops, electrical linemen on towers, construction workers on scaffolding, and maintenance technicians on elevated structures. The harness distributes fall-arrest forces across the thighs, pelvis, chest, and shoulders, minimising injury risk in the event of a fall. Adjustable leg straps, chest strap, and shoulder straps accommodate a range of body sizes. A dorsal D-ring provides the primary fall arrest attachment point, while front and side D-rings allow work positioning and restraint connections. Meets safety standards for fall protection equipment. Use with an appropriate lanyard and anchor point."
  },
  {
    "id": "698505d0346d6159eee7f801",
    "title": "glass fuse",
    "slug": "glass-fuse",
    "productType": "simple",
    "shortDescription": "Glass cartridge fuse for protecting small electronics, instruments, and control circuits.",
    "description": "The Glass Fuse is a standard cartridge-type fuse with a transparent glass body that allows visual inspection of the fuse element. When the circuit draws excessive current, the thin wire element inside melts and breaks the circuit, protecting downstream equipment from damage. The clear glass body lets you see at a glance whether the fuse has blown — a blackened interior or broken wire confirms a fault. Used widely in inverters, charge controllers, control panels, amplifiers, power supplies, and other electronic equipment that requires precise overcurrent protection. Available in various current ratings and physical sizes to match your equipment's fuse holder and protection requirements."
  },
  {
    "id": "698503b5346d6159eee7f74f",
    "title": "industrial  motor siren 1km radius",
    "slug": "industrial-motor-siren-1km-radius",
    "productType": "simple",
    "shortDescription": "Industrial electric motor siren with a 1km audible range for factory shift signals and emergency alerts.",
    "description": "The Industrial Motor Siren with 1km range is a powerful electromechanical warning device that produces a loud, distinctive wailing tone audible up to one kilometre away. Used in factories, mines, schools, warehouses, and rural communities as a shift-change signal, emergency alert, or general warning alarm. The electric motor spins an internal rotor to produce sound mechanically, resulting in a piercing tone that cuts through ambient noise. Operates on mains power and requires only a simple on/off switch or timer for activation. The durable all-metal construction withstands outdoor mounting and harsh industrial environments. Mount on a rooftop, pole, or high wall for maximum sound coverage."
  },
  {
    "id": "698503ca346d6159eee7f761",
    "title": "industrial  motor siren 2km",
    "slug": "industrial-motor-siren-industrial",
    "productType": "simple",
    "shortDescription": "Heavy-duty industrial motor siren with a 2km audible range for large facilities and wide-area alerts.",
    "description": "The Industrial Motor Siren with 2km range is the high-power version of the electromechanical warning siren, delivering an ear-piercing wail that carries up to two kilometres across open terrain. Designed for large industrial complexes, mining operations, military installations, and municipal emergency warning systems where a wider coverage area is essential. The larger motor and horn assembly generate significantly more acoustic output than the 1km model. Controlled by a simple contactor or timer circuit, it can be integrated into automated shift-management systems or emergency alert infrastructure. Robust steel construction and corrosion-resistant finish ensure years of reliable outdoor service."
  },
  {
    "id": "698502d7346d6159eee7f651",
    "title": "integrated prepaid token meters",
    "slug": "integrated-prepaid-token-meters",
    "productType": "simple",
    "shortDescription": "Integrated prepaid electricity meter with built-in display and token input for pay-as-you-go power management.",
    "description": "The Integrated Prepaid Token Meter is a single-unit electricity meter that combines metering, token input, and display into one compact device. Unlike split-type meters that have a separate keypad unit, the integrated model handles everything in board — tenants enter their purchased token directly on the meter's keypad, and the display shows remaining credit, current consumption, and tamper alerts. Ideal for landlords, property managers, and housing developments that need a simple, cost-effective prepaid billing solution without the complexity of running additional wiring to a separate customer interface unit. DIN-rail or panel mountable, it installs in the main distribution board and provides accurate, tamper-resistant energy measurement with automatic disconnection when credit runs out."
  },
  {
    "id": "69850291346d6159eee7f531",
    "title": "katiko manual changeover switch",
    "slug": "katiko-manual-changeover-switch",
    "productType": "simple",
    "shortDescription": "Manual changeover switch for safely switching between mains power and a generator or alternative supply.",
    "description": "The Katiko Manual Changeover Switch allows you to safely switch your electrical load between two power sources — typically the utility mains supply and a backup generator or inverter. The rotary handle has three positions: Source 1, Off, and Source 2, with a clear mechanical interlock that prevents both sources from being connected simultaneously, eliminating the risk of backfeed that could damage equipment or endanger utility workers. Simply turn the handle to transfer your entire distribution board from one supply to the other. Suitable for residential, commercial, and light-industrial applications. Mounts inside or adjacent to the distribution board and wires directly to both incoming supplies and the load busbars."
  },
  {
    "id": "69850388346d6159eee7f707",
    "title": "led 12v dc tape striplight",
    "slug": "led-12v-dc-tape-striplight",
    "productType": "simple",
    "shortDescription": "12V DC LED tape strip light for accent lighting, cove lighting, and decorative installations.",
    "description": "The 12V DC LED Tape Strip Light is a flexible, self-adhesive strip of surface-mount LEDs that can be applied to almost any clean, dry surface for accent, task, or decorative lighting. Peel off the backing and stick it under cabinets, inside shelving, along ceiling coves, behind TVs, around mirrors, or anywhere you want a clean line of light without visible fixtures. The flexible PCB bends around gentle curves and can be cut at marked intervals to fit any length. Runs on 12V DC from a compatible power supply or directly from a 12V solar battery system, making it popular for off-grid lighting as well as mains-powered interior design projects. Available in warm white, cool white, and RGB colour-changing variants."
  },
  {
    "id": "6985035b346d6159eee7f6db",
    "title": "led smd strip light",
    "slug": "led-smd-strip-light",
    "productType": "simple",
    "shortDescription": "High-density SMD LED strip light for bright, continuous illumination in commercial and decorative use.",
    "description": "The LED SMD Strip Light features densely packed surface-mount diodes (SMDs) for a brighter, more continuous light output than standard LED tape. The higher LED count per metre reduces the visible gaps between light points, resulting in smoother illumination that is ideal for professional installations such as retail display lighting, hospitality accent lighting, architectural cove lighting, and signage backlighting. Self-adhesive backing simplifies installation on flat surfaces, while the flexible PCB substrate allows gentle bends. Cuttable at marked intervals for precision fitting. Powered by a 12V or 24V DC supply depending on the variant. Pair with an aluminium profile and diffuser for an even, shadow-free light line."
  },
  {
    "id": "6985024a346d6159eee7f425",
    "title": "mc4 climping tool",
    "slug": "mc4-climping-tool",
    "productType": "simple",
    "shortDescription": "Professional MC4 connector crimping tool for making reliable solar PV cable terminations.",
    "description": "The MC4 Crimping Tool is a purpose-built hand tool for crimping MC4 solar connectors onto PV cable. MC4 connectors are the industry-standard plug-and-socket system used to connect solar panels to each other and to the rest of the PV system. A proper crimp — made with the correct tool — creates a gas-tight, low-resistance connection that withstands decades of outdoor exposure, thermal cycling, and vibration. Using pliers or generic crimpers risks loose connections that cause voltage drop, overheating, and fire. This tool's calibrated die set produces a consistent, manufacturer-specified crimp every time. Ergonomic handles with ratchet action ensure full crimp completion. An essential tool for any solar installer."
  },
  {
    "id": "69850470346d6159eee7f783",
    "title": "motor siren radius 0.5km",
    "slug": "motor-siren-radius-0-5km",
    "productType": "simple",
    "shortDescription": "Compact electric motor siren with 0.5km range for small premises and localised alert systems.",
    "description": "The Motor Siren with 0.5km range is a compact electromechanical warning device suitable for small factories, workshops, schools, farms, and residential compounds. It produces a loud wailing tone audible up to 500 metres, providing effective notification for shift changes, break times, security alerts, and emergency evacuations within a localised area. The smaller motor and horn assembly make it lighter and easier to mount than larger industrial sirens, while still delivering a piercing sound that cuts through normal background noise. Operates on mains power via a simple switch, timer, or alarm system trigger. Durable metal construction ensures reliable outdoor service."
  },
  {
    "id": "698502b1346d6159eee7f5c1",
    "title": "motorized  ATS 63A",
    "slug": "motorized-63a-ats",
    "productType": "simple",
    "shortDescription": "63A motorised automatic transfer switch for seamless switchover between mains and backup power.",
    "description": "The Motorised ATS 63A is an automatic transfer switch that monitors your mains power supply and automatically switches your load to a backup source (generator, inverter, or second utility feed) when a power failure is detected. When mains power returns, it transfers back automatically after a stabilisation delay. The motorised mechanism provides reliable, repeatable switching action rated at 63 amps, suitable for homes, small offices, shops, and light commercial premises. Unlike manual changeover switches, the ATS requires no human intervention, ensuring uninterrupted power even when the premises are unattended. Includes adjustable voltage sensing thresholds and transfer delay timers. DIN-rail mountable for installation inside the distribution board."
  },
  {
    "id": "698502c0346d6159eee7f609",
    "title": "on off project switch",
    "slug": "on-off-project-switch",
    "productType": "simple",
    "shortDescription": "Simple on/off toggle switch for DIY projects, control panels, and custom electrical assemblies.",
    "description": "The On/Off Project Switch is a straightforward toggle or rocker switch designed for use in custom control panels, DIY electronics projects, prototype assemblies, and equipment modifications. A clear on/off position provides positive confirmation of circuit state. The compact body mounts through a standard panel cutout with a nut or snap-in clip. Screw or solder terminals accept wire connections up to its rated current capacity. Suitable for switching lighting circuits, fans, pumps, solenoids, and other loads in custom-built equipment. Available in various current ratings to match your project's requirements. A simple, reliable switching solution for builders and makers."
  },
  {
    "id": "69850547346d6159eee7f7cb",
    "title": "original earthrod 14mm 4ff",
    "slug": "original-earthrod-14mm-4ff",
    "productType": "simple",
    "shortDescription": "14mm x 4ft copper-bonded earth rod for establishing a reliable earthing connection.",
    "description": "The Original Earth Rod (14mm diameter, 4 feet long) is a copper-bonded steel grounding rod that is driven into the soil to establish a low-impedance earth connection for electrical installations. Earthing is a critical safety measure that provides a path for fault current to flow safely to ground, enabling protective devices like RCDs and MCBs to trip quickly and disconnect the supply before anyone is harmed. The copper bonding prevents corrosion in the soil, maintaining a reliable earth connection for decades. The 14mm diameter and 4-foot length provide sufficient soil contact for most residential and light commercial installations. Drive it into the ground using a hammer or SDS driver with an earth rod driving head, then connect your earth conductor using a clamp."
  },
  {
    "id": "69850294346d6159eee7f543",
    "title": "porcelain  holders",
    "slug": "porcelain-holders",
    "productType": "simple",
    "shortDescription": "Porcelain lamp holders for heat-resistant bulb connections in industrial and basic lighting.",
    "description": "Porcelain Lamp Holders are heat-resistant ceramic bulb sockets used where high temperatures or demanding conditions make plastic holders unsuitable. Porcelain does not melt, warp, or discolour under prolonged heat exposure, making these holders ideal for use with incandescent bulbs, heat lamps, brooder lamps in poultry houses, kiln lighting, and industrial environments. The standard E27 (Edison screw) fitting accepts the most common bulb base size. Simple screw-terminal wiring makes installation straightforward. Surface-mount or pendant-mount configurations are available. Porcelain holders have been the trusted choice for decades in applications where durability and heat resistance matter more than aesthetics."
  },
  {
    "id": "69850626346d6159eee7f81b",
    "title": "pv fuses and holders",
    "slug": "pv-fuses",
    "productType": "simple",
    "shortDescription": "PV-rated fuses and fuse holders for protecting solar panel string circuits.",
    "description": "PV Fuses and Holders are DC-rated fuse links and their corresponding fuse holders designed specifically for protecting solar photovoltaic string circuits. In a solar array with multiple parallel strings, a fuse on each string prevents reverse current from flowing through a faulted string, which could overheat the cables and cause fire. PV fuses are rated for the high DC voltages encountered in solar systems (up to 1000V or 1500V DC) and are designed to safely interrupt DC fault current, which is harder to break than AC due to the absence of a zero-crossing point. The fuse holders accept standard 10x38mm PV fuse links and mount inside string combiner boxes. Replace fuses without tools using the pull-out carrier."
  },
  {
    "id": "69850267346d6159eee7f47d",
    "title": "pv solar disconect",
    "slug": "pv-solar-disconect",
    "productType": "simple",
    "shortDescription": "DC isolator switch for safely disconnecting solar PV arrays during maintenance and emergencies.",
    "description": "The PV Solar Disconnect is a DC-rated isolator switch that provides a safe, visible means of disconnecting the solar panel array from the inverter, charge controller, or combiner box. Unlike AC switches, this isolator is specifically designed to break high-voltage DC circuits — which is significantly harder because DC arcs do not self-extinguish at zero crossings like AC arcs do. The enclosed rotary handle provides clear on/off indication and can be padlocked in the off position for lockout/tagout during maintenance. Required by electrical codes at multiple points in a PV system: between the array and inverter, and often at the roof penetration point. Weatherproof enclosure for outdoor installation near the solar panels."
  },
  {
    "id": "69850263346d6159eee7f46b",
    "title": "pv solar fuse 32A,20A, 16A",
    "slug": "product-3",
    "productType": "simple",
    "shortDescription": "DC-rated PV solar fuses available in 16A, 20A, and 32A for protecting solar string circuits.",
    "description": "PV Solar Fuses in 16A, 20A, and 32A ratings are high-voltage DC fuse links designed to protect individual string circuits in solar photovoltaic arrays. Each fuse is rated for DC voltages up to 1000V, ensuring safe interruption of fault current in solar systems. The 16A size suits strings with lower-current panels, the 20A is the most common for standard residential panels, and the 32A protects higher-current commercial panel strings. Standard 10x38mm cylindrical form factor fits industry-standard PV fuse holders in combiner boxes. These fuses act as the first line of defence against overcurrent caused by ground faults, short circuits, or reverse current flow in parallel string configurations. Always match the fuse rating to the panel string's maximum series fuse rating."
  },
  {
    "id": "6985052f346d6159eee7f7b9",
    "title": "rotary  led strobe",
    "slug": "rotary-led-strobe",
    "productType": "simple",
    "shortDescription": "Rotating LED strobe warning light for vehicles, machinery, gates, and security alert systems.",
    "description": "The Rotary LED Strobe is a high-visibility warning light that produces a bright, rotating flash pattern visible from all angles. Used on forklifts, construction vehicles, gate pillars, warehouse entrances, generator enclosures, and alarm systems to draw attention to hazards, moving equipment, or security events. The LED light source provides intense brightness with low power consumption and a lifespan far exceeding incandescent rotating beacons. Multiple flash patterns (rotating, strobe, steady) can typically be selected to suit the application. Available in amber, red, blue, green, and white. The compact dome housing with magnetic, bolt, or bracket mount options ensures quick installation on any surface."
  },
  {
    "id": "6985028a346d6159eee7f51f",
    "title": "safety marine aviation lights",
    "slug": "safety-marine-aviation-lights",
    "productType": "simple",
    "shortDescription": "Multi-purpose safety light for marine navigation and aviation obstruction marking.",
    "description": "Safety Marine Aviation Lights are high-visibility warning lights designed to serve dual roles: marking marine navigation hazards (buoys, docks, channel markers, jetties) and acting as aviation obstruction lights on coastal masts and towers. The weatherproof, corrosion-resistant housing withstands saltwater spray, humidity, and constant UV exposure in marine environments. The LED light source provides thousands of hours of maintenance-free operation, critical for remote or hard-to-access installations. Multiple flash modes meet various marine and aviation regulatory requirements. Solar-compatible models allow fully autonomous operation without mains power. An essential safety product for harbours, marinas, offshore platforms, and any tall structure near waterways."
  },
  {
    "id": "69850243346d6159eee7f401",
    "title": "sigle mc4 solar connectors",
    "slug": "sigle-mc4-solar-connectors",
    "productType": "simple",
    "shortDescription": "Individual MC4 male and female solar connectors for custom PV cable assemblies.",
    "description": "Single MC4 Solar Connectors are the industry-standard plug-and-socket connectors used throughout solar PV systems to create secure, weatherproof, and tool-free electrical connections between panels, extension cables, combiner boxes, and inverters. Each connector consists of a male or female contact pin, an insulating housing, and a cable gland that grips the PV cable and seals out moisture. The snap-lock mechanism ensures connectors stay firmly mated even in wind and vibration. IP67-rated for outdoor use, they resist UV degradation, rain, and temperature extremes. Sold individually so you can build custom cable lengths and configurations. Always crimp with a proper MC4 crimping tool for a reliable, low-resistance connection."
  },
  {
    "id": "6985027a346d6159eee7f4d7",
    "title": "sigle patress, twin patress",
    "slug": "sigle-patress-twin-patress",
    "productType": "variable",
    "shortDescription": "Surface-mount patress boxes in single and twin sizes for mounting switches and sockets on walls.",
    "description": "Patress boxes (also called pattress or surface boxes) are the mounting enclosures that sit on the wall surface and house the wiring behind your switches and sockets. The single patress accommodates one-gang faceplates (single switches, single sockets), while the twin patress fits two-gang faceplates (double switches, twin sockets). Made from durable PVC, they provide a neat, enclosed space for cable terminations where flush (recessed) boxes are impractical — such as on solid concrete or brick walls, in outbuildings, and during surface-wiring installations. Pre-punched cable entry knockouts on all sides and the back allow flexible cable routing. Available in standard depths to suit most faceplates and wiring configurations."
  },
  {
    "id": "69850286346d6159eee7f50d",
    "title": "solar powered aviation  lights",
    "slug": "solar-powered-aviation-lights",
    "productType": "simple",
    "shortDescription": "Solar-powered aviation obstruction lights for autonomous operation on remote towers and tall structures.",
    "description": "Solar Powered Aviation Lights are self-contained obstruction warning lights that use an integrated solar panel and rechargeable battery to operate without any external power source. They are purpose-built for marking the tops of communication towers, wind masts, tall buildings, cranes, and other structures that require aviation obstruction lighting in locations where running mains power is impractical or prohibitively expensive. The solar panel charges the battery during the day, and a light sensor activates the red or white LED beacon automatically at dusk. Designed for years of reliable, unattended operation, the sealed unit withstands extreme weather, UV exposure, and the vibrations encountered at the top of tall structures. Eliminates ongoing electricity costs and the need for power cable runs to elevation."
  },
  {
    "id": "69850250346d6159eee7f437",
    "title": "solar pv climping tool pliers",
    "slug": "solar-pv-climping-tool-pliers",
    "productType": "simple",
    "shortDescription": "Multi-purpose solar PV tool combining wire stripping, cable cutting, and MC4 crimping in one plier.",
    "description": "The Solar PV Crimping Tool Pliers is a multi-function hand tool that combines cable cutting, wire stripping, and MC4 connector crimping into a single instrument. Instead of carrying three separate tools on a solar installation job, this all-in-one plier handles the complete PV cable preparation and termination workflow: cut the cable to length, strip the insulation to expose the conductor, and crimp the MC4 connector pin — all with one tool. The calibrated crimp die ensures consistent, reliable connections that meet connector specifications. Comfortable, insulated handles provide a secure grip. Compact enough to fit in a tool belt or pouch. A time-saving, space-saving essential for solar installers and maintenance technicians."
  },
  {
    "id": "698503a8346d6159eee7f73d",
    "title": "spot welding machine",
    "slug": "spot-welding-machine",
    "productType": "variable",
    "shortDescription": "Spot welding machine for joining nickel strips to battery cells in battery pack assembly.",
    "description": "The Spot Welding Machine is designed for building custom lithium-ion and nickel-metal-hydride battery packs by welding thin nickel connecting strips to battery cell terminals. Spot welding is the preferred method for joining nickel tabs to cells because it delivers a fast, concentrated pulse of current that creates a strong weld without heating the battery cell enough to damage it — unlike soldering, which can overheat and degrade cell chemistry. Adjustable pulse energy settings let you dial in the perfect weld for different strip thicknesses and cell sizes. Used by battery pack builders for e-bikes, solar storage banks, power walls, portable power stations, and custom battery projects. Available in different power capacities to suit hobbyist or professional production volumes."
  },
  {
    "id": "698502b6346d6159eee7f5d3",
    "title": "stringed 2by1 mc4",
    "slug": "stringed-2by1-mc4",
    "productType": "simple",
    "shortDescription": "2-to-1 MC4 Y-branch connector for combining two solar panel strings into one cable.",
    "description": "The Stringed 2-to-1 MC4 connector (Y-branch) combines the output of two parallel solar panel strings into a single cable, reducing the number of connections at the inverter or combiner box. Instead of running two separate cables from two strings, the Y-branch merges them into one, simplifying cable management on the roof and in the cable tray. The connector maintains the weatherproof, snap-lock MC4 standard with IP67 protection. UV-resistant housing and PPO insulation ensure long-term outdoor reliability. Available in both positive and negative configurations to match your array wiring. Essential for systems with multiple parallel strings where you want to minimise cable runs and connection points. Always ensure the combined string current does not exceed the cable and connector rating."
  },
  {
    "id": "698506fd346d6159eee7f8cf",
    "title": "svc 10kva ac stabilizer",
    "slug": "svc-10kva-ac-stabilizer",
    "productType": "simple",
    "shortDescription": "10KVA automatic voltage stabilizer for protecting equipment from voltage fluctuations and surges.",
    "description": "The SVC 10KVA AC Stabilizer is an automatic voltage regulator that continuously monitors the incoming mains voltage and corrects it to a stable output, protecting your connected equipment from the damaging effects of voltage fluctuations, surges, sags, and brownouts. With a 10KVA capacity, it can stabilize the supply for an entire home, office, or workshop — covering refrigerators, computers, air conditioners, televisions, and other sensitive electronics simultaneously. The servo-motor-driven mechanism provides smooth, stepless voltage correction with fast response time. A digital display shows input voltage, output voltage, and load status in real time. Over-voltage and under-voltage protection trips automatically if conditions exceed correctable range. Essential in areas with unreliable or fluctuating grid supply."
  },
  {
    "id": "698502c5346d6159eee7f61b",
    "title": "wall lamp",
    "slug": "wall-lamp",
    "productType": "simple",
    "shortDescription": "Decorative wall-mounted lamp for ambient and accent lighting in homes, hotels, and offices.",
    "description": "The Wall Lamp is a decorative light fixture that mounts directly to the wall surface, providing ambient, accent, or task lighting without taking up floor or table space. The upward and/or downward light wash creates a warm, inviting atmosphere in hallways, living rooms, bedrooms, staircases, hotel corridors, and restaurant dining areas. The contemporary design complements modern and transitional interiors. Standard E27 or E14 bulb fitting (depending on model) accepts LED bulbs for energy-efficient operation. Wires to a wall-mounted junction box, and can be controlled by a wall switch or smart dimmer for adjustable brightness. A simple way to add layers of light to your interior design scheme."
  },
  {
    "id": "69850111346d6159eee7f0da",
    "title": "wooden Pole Climber 10\"",
    "slug": "concrete-pole-climber-2",
    "productType": "simple",
    "shortDescription": "10-inch wooden pole climbing spikes for linemen working on treated wooden utility poles.",
    "description": "The Wooden Pole Climber (10 inch) is a pair of strap-on climbing gaffs with 10-inch steel spikes designed specifically for ascending wooden utility poles. The longer spike length penetrates through the outer layer of treated timber to grip the solid wood beneath, providing a secure foothold for linemen, electricians, and telecom technicians working on overhead wooden power and communication poles. Adjustable leg irons and padded leather or nylon straps secure the climber comfortably to the lower leg and ankle. The hardened steel gaff points maintain sharpness through repeated use and can be resharpened when needed. Always use with a positioning belt or full-body harness for safe working at height. Built for daily professional use in all weather conditions."
  }
]
